var num_max = 20;
var mondai = [];
var seitou = [];
var kaitou = [];

mondai[1] = "エイコサノイドとは、炭素数20の不飽和脂肪酸由来の生理活性物質の総称である。";
seitou[1] = 'm';
kaitou[1] = "";

mondai[2] = "代表的なエイコサノイドには、プロスタグランジン(PG)、トロンボキサン(TX)、ロイコトリエン(LT)がある。";
seitou[2] = 'm';
kaitou[2] = "";

mondai[3] = "非ステロイド性抗炎症薬(NSAIDs)は、プロスタグランジンの生合成を阻害する。";
seitou[3] = 'm';
kaitou[3] = "";

mondai[4] = "アラキドン酸は、細胞膜リン脂質からホスホリパーゼCによって生成する。";
seitou[4] = 'b';
kaitou[4] = "ホスホリパーゼA<sub>2</sub>によって生成する。";

mondai[5] = "プロスタグランジンとロイコトリエンは、細胞内の小胞に貯蔵され、刺激に応じて分泌される。";
seitou[5] = 'b';
kaitou[5] = "エイコサノイドは貯蔵されることはなく、生成と同時に分泌される。";

mondai[6] = "アラキドン酸にシクロオキシゲナーゼが作用すると、ロイコトリエンが生成される。";
seitou[6] = 'b';
kaitou[6] = "プロスタグランジンが生成される。";

mondai[7] = "トロンボキサンA<sub>2</sub>(TXA<sub>2</sub>)は、リポキシゲナーゼによりプロスタグランジンから生成する。";
seitou[7] = 'b';
kaitou[7] = "トロンボキサン合成酵素により生成される。";

mondai[8] = "リポキシゲナーゼは、白血球、血小板などの組織に見いだされる。";
seitou[8] = 'm';
kaitou[8] = "";

mondai[9] = "プロスタグランジンF<sub>α2</sub>(PGF<sub>2α</sub>)には、子宮平滑筋収縮作用がある。";
seitou[9] = 'm';
kaitou[9] = "";

mondai[10] = "トロンボキサンA<sub>2</sub>は、血小板凝集抑制作用を示す。";
seitou[10] = 'b';
kaitou[10] = "血小板凝集促進作用や血管収縮作用などがある。";

mondai[11] = "プロスタグランジンI<sub>2</sub>(PGI<sub>2</sub>)は、血管内皮細胞でつくられる。";
seitou[11] = 'm';
kaitou[11] = "";

mondai[12] = "ロイコトリエンB<sub>4</sub>(PGI<sub>2</sub>)は、白血球の遊走に関与する。";
seitou[12] = 'm';
kaitou[12] = "";

mondai[13] = "セロトニンは、腸クロム親和性細胞に多く存在する。";
seitou[13] = 'm';
kaitou[13] = "";

mondai[14] = "ヒスタミンは、血管拡張作用を示す。";
seitou[14] = 'm';
kaitou[14] = "";

mondai[15] = "ヒスタミンの胃酸分泌作用は、ヒスタミンH<sub>1</sub>受容体を介して発現する。";
seitou[15] = 'b';
kaitou[15] = "ヒスタミンH<sub>2</sub>受容体を介する作用である。";

mondai[16] = "アンギオテンシン変換酵素(ACE)は、アンギオテンシノーゲンからアンギオテンシンIを生成する。";
seitou[16] = 'b';
kaitou[16] = "アンギオテンシンIからアンギオテンシンIIを生成する。";

mondai[17] = "アンギオテンシン変換酵素は、キニナーゼIIと同一の酵素である。";
seitou[17] = 'm';
kaitou[17] = "";

mondai[18] = "心房性ナトリウム利尿ペプチド(ANP)は、血圧上昇作用を示す。";
seitou[18] = 'b';
kaitou[18] = "利尿作用などを介して血圧を降下させる。";

mondai[19] = "一酸化窒素(NO)は、血管内皮細胞で合成される。";
seitou[19] = 'm';
kaitou[19] = "";

mondai[20] = "一酸化窒素は、血管平滑筋弛緩作用をもつ。";
seitou[20] = 'm';
kaitou[20] = "";