var num_max = 28;
var mondai = [];
var seitou = [];
var kaitou = [];

mondai[1] = "ATPの高エネルギーリン酸結合が加水分解されると自由エネルギーが放出する。";
seitou[1] = 'm';
kaitou[1] = "";

mondai[2] = "生体内にはATP以外にも種々の高エネルギー結合をもった化合物が存在する。";
seitou[2] = 'm';
kaitou[2] = "";

mondai[3] = "解糖系に関与する酵素は、すべてミトコンドリアに存在する。";
seitou[3] = 'b';
kaitou[3] = "解糖系に関与する酵素は<b>細胞質ゾル</b>に存在する。";

mondai[4] = "フルクトース1,6-ビスリン酸は解糖系の中間体の1つである。";
seitou[4] = 'm';
kaitou[4] = "";

mondai[5] = "解糖系では、1モルのグルコースから2モルのATPが得られる。";
seitou[5] = 'm';
kaitou[5] = "";

mondai[6] = "ピルビン酸からアセチルCoAを生じる過程は不可逆である。";
seitou[6] = 'm';
kaitou[6] = "";

mondai[7] = "クエン酸回路は細胞質ゾルで行われる。";
seitou[7] = 'b';
kaitou[7] = "クエン酸回路は<b>ミトコンドリア</b>で行われる。";

mondai[8] = "1分子のアセチルCoAがクエン酸回路で代謝されると3分子のNADHが生成する。";
seitou[8] = 'm';
kaitou[8] = "";

mondai[9] = "クエン酸回路においてクエン酸がオキサロ酢酸に変換される過程で2分子の二酸化炭素を放出する。";
seitou[9] = 'm';
kaitou[9] = "";

mondai[10] = "ミトコンドリア内で生じたNADHは、電子伝達系で酸化される。";
seitou[10] = 'm';
kaitou[10] = "";

mondai[11] = "電子の最終的な受容体は酸素分子である。";
seitou[11] = 'm';
kaitou[11] = "";

mondai[12] = "細胞質で生じたNADHは直接ミトコンドリアに移行する。";
seitou[12] = 'b';
kaitou[12] = "細胞質で生じたNADHは、ミトコンドリア膜を直接通過できないためグリセロールリン酸シャトル、リンゴ酸-アスパラギン酸シャトルにより、その還元力をミトコンドリアに運び電子伝達系に入る。";

mondai[13] = "脂肪酸は、細胞質でβ酸化反応を受ける。";
seitou[13] = 'b';
kaitou[13] = "β酸化反応は、主としてミトコンドリアのマトリックスで行われ、一部はペルオキシソームでも行われる。";

mondai[14] = "脂肪酸は、アシルCoAとなってβ酸化反応を受ける。";
seitou[14] = 'm';
kaitou[14] = "";

mondai[15] = "不飽和脂肪酸はβ酸化を受けない。";
seitou[15] = 'b';
kaitou[15] = "不飽和脂肪酸もβ酸化を受ける。";

mondai[16] = "アセチルCoAは種々の生体成分を合成するための材料となる。";
seitou[16] = 'm';
kaitou[16] = "";

mondai[17] = "アセチルCoAは、直接ピルビン酸に代謝され、糖新生の材料となる。";
seitou[17] = 'b';
kaitou[17] = "ピルビン酸からアセチルCoAになる経路は不可逆である。";

mondai[18] = "コレステロールはアセチルCoAを出発物質として生合成される。";
seitou[18] = 'm';
kaitou[18] = "";

mondai[19] = "ミトコンドリアでは、嫌気的代謝によるATP合成が行われている。";
seitou[19] = 'b';
kaitou[19] = "ミトコンドリアでは、好気的代謝によりATP合成が行われている。";

mondai[20] = "ミトコンドリア内膜にはクリステとよばれるひだ状構造がある。";
seitou[20] = 'm';
kaitou[20] = "";

mondai[21] = "ミトコンドリア内膜では、シトクロムcの遊離によりアポトーシスが誘導される。";
seitou[21] = 'm';
kaitou[21] = "";

mondai[22] = "脱共役剤は、電子伝達系における電子の流れを阻害する。";
seitou[22] = 'b';
kaitou[22] = "電子伝達系における電子の流れを阻害するのは、呼吸鎖阻害剤である。";

mondai[23] = "ピルビン酸キナーゼは、高濃度のATPで阻害される。";
seitou[23] = 'm';
kaitou[23] = "";

mondai[24] = "ロテノンは、ミトコンドリア内膜上の複合体Iを阻害する。";
seitou[24] = 'm';
kaitou[24] = "";

mondai[25] = "ペントースリン酸回路では、還元剤であるNADHが生成する。";
seitou[25] = 'b';
kaitou[25] = "ペントースリン酸回路では、<b>NADPH</b>が生成する。";

mondai[26] = "ペントースリン酸回路では、グルコース-6-リン酸の酸化がおこる。";
seitou[26] = 'm';
kaitou[26] = "";

mondai[27] = "ペントースリン酸回路中では、2分子のATPが生成される。";
seitou[27] = 'b';
kaitou[27] = "ペントースリン酸回路ではATP産生は行われない。";

mondai[28] = "酵母によって生成されたエタノールは、ヒト体内で代謝され、アセトアルデヒドを生成する。";
seitou[28] = 'm';
kaitou[28] = "";