var num_max = 14;
var mondai = [];
var seitou = [];
var kaitou = [];

mondai[1] = "過マンガン酸塩の硫酸酸性溶液に過量のH<sub>2</sub>O<sub>2</sub>試液を加えると、泡立って脱色する。";
seitou[1] = 'm';
kaitou[1] = "";

mondai[2] = "炭酸塩と炭酸水素塩の区別は、その冷却液にメチルレッド試液を加えて行う。";
seitou[2] = 'b';
kaitou[2] = "メチルレッドではなく、フェノールフタレインである。";

mondai[3] = "カリウム塩の炎色反応は、銅網を用いて行う。";
seitou[3] = 'b';
kaitou[3] = "銅網ではなく、白金線を用いる。";

mondai[4] = "チオ硫酸塩と硫酸塩はそれぞれの溶液に希塩酸を加えることで区別できる。";
seitou[4] = 'm';
kaitou[4] = "チオ硫酸塩では白濁し、硫酸塩では白濁しない。";

mondai[5] = "塩化物の溶液に硫酸および過マンガン酸カリウムを加えて加熱すると、塩化水素ガスを発生する。";
seitou[5] = 'b';
kaitou[5] = "塩化水素ガスではなく、塩素ガスが発生する。この塩素ガスがKI-デンプン紙を青変することを利用して確認する。";

mondai[6] = "塩化鉄(III)試液により、フェノール性水酸基を";
seitou[6] = 'm';
kaitou[6] = "";

mondai[7] = "メチルケトン基はヨードホルム反応で確認できる。";
seitou[7] = 'm';
kaitou[7] = "メチルケトン基は水酸化ナトリウム存在下、ヨウ素と反応して、ヨードホルムを生成する。";

mondai[8] = "レボチロキシンナトリウム水和物を直火で加熱したときに発生する紫色のガスは、塩素ガスである。";
seitou[8] = 'b';
kaitou[8] = "塩素ガスではなく、ヨウ素ガスである。ヨウ素含有医薬品の確認試験である。";

mondai[9] = "アミノ酸はニンヒドリン試薬を加えて加熱すると赤紫~青紫色を呈する。";
seitou[9] = 'm';
kaitou[9] = "ニンヒドリン反応である。";

mondai[10] = "アトロピン硫酸塩水和物のようなトロパンアルカロイドは、ムレキシド反応により確認する。";
seitou[10] = 'b';
kaitou[10] = "ムレキシド反応ではなく、ビタリー・フリーマン(Vitali-Freeman)反応である。ムレキシド反応は、キサンチン骨格の確認に用いる。";

mondai[11] = "純度試験とは医薬品中の混合物の試験である。";
seitou[11] = 'm';
kaitou[11] = "通例、その混合物の種類および量が規定されている。";

mondai[12] = "重金属試験法の比較液には、カドミウム標準液が用いられる。";
seitou[12] = 'b';
kaitou[12] = "鉛標準液を用い、鉛の量として表される。";

mondai[13] = "アンモニウム試験法は医薬品中に混在するアンモニウム塩の限界試験である。";
seitou[13] = 'm';
kaitou[13] = "アンモニウム(<sup>+</sup>NH<sub>4</sub>)の量として表す。";

mondai[14] = "医薬品中に混在するヒ素の限度試験であるヒ素試験法は、その限度をヒ素(As)の量として表す。";
seitou[14] = 'b';
kaitou[14] = "三酸化二ヒ素(As<sub>2</sub>O<sub>3</sub>)の量としてppmで示す。";
