var num_max = 6;
var mondai = [];
var seitou = [];
var kaitou = [];

mondai[1] = "サザンブロット法は、遺伝子の発現レベルを解析する方法である。";
seitou[1] = 'b';
kaitou[1] = "サザンブロット法は、遺伝子DNAの大きさ(長さ)などの構造や量を調べるのに用いられる。";

mondai[2] = "ノーザンブロット法は、抗体を用いてタンパク質を検出する方法である。";
seitou[2] = 'b';
kaitou[2] = "ノーザンブロット法じゃ、プローブを用いてRNAを検出する。";

mondai[3] = "ウイルスや細菌の感染の有無を調べる方法として、PCR法を用いたものがある。";
seitou[3] = 'm';
kaitou[3] = "";

mondai[4] = "ハイブリダイゼーション法において用いられる探索子をプローブとよぶ。";
seitou[4] = 'm';
kaitou[4] = "";

mondai[5] = "ハイブリダイゼーション法では、プローブとしてオリゴヌクレオチドが用いられる。";
seitou[5] = 'm';
kaitou[5] = "";

mondai[6] = "大腸菌のプラスミドにクローニングされた遺伝子は動物細胞の中でも発現させることができる。";
seitou[6] = 'm';
kaitou[6] = "";