var num_max = 14;
var mondai = [];
var seitou = [];
var kaitou = [];

mondai[1] = "一般に、細菌の細胞壁にはペプチドグリカンが含まれる。";
seitou[1] = 'm';
kaitou[1] = "";

mondai[2] = "一般に、細菌の細胞膜にはステロール類が含まれる。";
seitou[2] = 'b';
kaitou[2] = "ステロール類は真核生物の細胞膜に含まれる。";

mondai[3] = "細菌が増殖に利用できる水分は、食品中の自由水のみである。";
seitou[3] = 'm';
kaitou[3] = "";

mondai[4] = "細菌は有糸分裂により増殖する。";
seitou[4] = 'b';
kaitou[4] = "細菌は無糸分裂により増殖する。";

mondai[5] = "グラム陽性菌の細胞壁にはリポ多糖が含まれる。";
seitou[5] = 'b';
kaitou[5] = "リポ多糖は、グラム陰性菌の細胞壁の外膜に含まれる。";

mondai[6] = "グラム陰性菌の細胞壁にはタイコ酸が含まれる。";
seitou[6] = 'b';
kaitou[6] = "タイコ酸はグラム陽性菌の細胞壁に含まれる。";

mondai[7] = "嫌気性菌は、活性酸素を処理する酵素群をもたない。";
seitou[7] = 'm';
kaitou[7] = "";

mondai[8] = "好気性菌は、酸素の有無にかかわらず増殖できる。";
seitou[8] = 'b';
kaitou[8] = "好気性菌の増殖には酸素が必須である。";

mondai[9] = "リケッチアは、偏性細胞寄生性を示す。";
seitou[9] = 'm';
kaitou[9] = "";

mondai[10] = "マイコプラズマに対して、β-ラクタム系抗菌薬では効果がない。";
seitou[10] = 'm';
kaitou[10] = "";

mondai[11] = "ヒトの腸内細胞の中には、ビタミンを合成するものもある。";
seitou[11] = 'm';
kaitou[11] = "";

mondai[12] = "ヒトの腸内細菌の中には、食物繊維に消化に働く酵素を分泌するものもある。";
seitou[12] = 'm';
kaitou[12] = "";

mondai[13] = "形質導入とは、バクテリオファージによる細菌DNAの伝達のことである。";
seitou[13] = 'm';
kaitou[13] = "";

mondai[14] = "Fプラスミドは、伝達性をもったプラスミドの1つである。";
seitou[14] = 'm';
kaitou[14] = "";