var num_max = 12;
var mondai = [];
var seitou = [];
var kaitou = [];

mondai[1] = "G<sub>0</sub>期の細胞は、増殖能力を保持しながら増殖停止状態にある。";
seitou[1] = 'm';
kaitou[1] = "";

mondai[2] = "体細胞分裂のM期では、DNAは2倍に複製される。";
seitou[2] = 'b';
kaitou[2] = "S期でDNAが2倍に複製される。";

mondai[3] = "DNAの複製を終えたG<sub>2</sub>期の細胞は、四倍体となる。";
seitou[3] = 'm';
kaitou[3] = "";

mondai[4] = "細胞分裂時にはクロマチンは凝縮して、染色体を形成する。";
seitou[4] = 'm';
kaitou[4] = "";

mondai[5] = "生殖細胞は子孫をつくるための細胞である。";
seitou[5] = 'm';
kaitou[5] = "";

mondai[6] = "1つの精母細胞は、減数分裂によって2つの精子をつくる。";
seitou[6] = 'b';
kaitou[6] = "精母細胞はDNA複製により四倍体となった後、2回続けて減数分裂を行い、4つの一倍体生殖細胞、つまり精子をつくる。";

mondai[7] = "ネクローシスでは、細胞内容物の流出がおこる。";
seitou[7] = 'm';
kaitou[7] = "";

mondai[8] = "アポトーシスでは、DNAのヌクレオソームの断片化がおこる。";
seitou[8] = 'm';
kaitou[8] = "";

mondai[9] = "ミトコンドリアから遊離されたシトクロムcはミトコンドリア、アポトーシスを抑制する。";
seitou[9] = 'b';
kaitou[9] = "シトクロムcはカスパーゼというタンパク質分解酵素を活性化し、アポトーシスを誘導する。";

mondai[10] = "癌には、良性腫瘍と悪性腫瘍がある。";
seitou[10] = 'b';
kaitou[10] = "癌は悪性腫瘍のみである。良性腫瘍は癌とはいわない。";

mondai[11] = "キラーT細胞やナチュラルキラー細胞(NK細胞)は、癌細胞を破壊する細胞である。";
seitou[11] = 'm';
kaitou[11] = "";

mondai[12] = "癌細胞は、血管内皮細胞増殖因子(VEGF)を分泌して、血管新生を行う。";
seitou[12] = 'm';
kaitou[12] = "";