var num_max = 6;
var mondai = [];
var seitou = [];
var kaitou = [];

mondai[1] = "小腸運動は、交感神経の興奮により促進される。";
seitou[1] = 'b';
kaitou[1] = "交感神経の興奮により抑制され、副交感神経の興奮により促進される。";

mondai[2] = "小腸の平滑筋層の間にはアウエルバッハ神経叢が存在する。";
seitou[2] = 'm';
kaitou[2] = "";

mondai[3] = "副交感神経刺激により希薄性の唾液分泌が促進する。";
seitou[3] = 'm';
kaitou[3] = "";

mondai[4] = "胃抑制ペプチド(GIP)は血糖依存的にインスリンの分泌を促進させる。";
seitou[4] = 'm';
kaitou[4] = "";

mondai[5] = "ソマトスタチンはインスリンの分泌を抑制する。";
seitou[5] = 'm';
kaitou[5] = "";

mondai[6] = "グルカゴンは、肝臓においてグリコーゲン分解を抑制する。";
seitou[6] = 'b';
kaitou[6] = "肝臓においてグリコーゲンからグルコースへの分解を促進する。";