var num_max = 20;
var mondai = [];
var seitou = [];
var kaitou = [];

mondai[1] = "塩化ナトリウムの結合は共有結合である。";
seitou[1] = 'b';
kaitou[1] = "イオン結合である。";

mondai[2] = "アンモニアのN-H結合は共有結合である。";
seitou[2] = 'm';
kaitou[2] = "";

mondai[3] = "水素化ナトリウムでは、水素は負に分極している";
seitou[3] = 'm';
kaitou[3] = "";

mondai[4] = "窒素分子の結合に、σ結合は含まれない。";
seitou[4] = 'b';
kaitou[4] = "すべての共有結合において、σ結合は必ず1本含まれる。";

mondai[5] = "アンモニアの窒素原子の非共有電子対は、プロトンと配位結合する。";
seitou[5] = 'm';
kaitou[5] = "";

mondai[6] = "エタンのC-H結合はσ結合である。";
seitou[6] = 'm';
kaitou[6] = "";

mondai[7] = "エチレンの二重結合はイオン結合である。";
seitou[7] = 'b';
kaitou[7] = "エチレンの二重結合は共に共有結合であり、σ結合とπ結合である。";

mondai[8] = "陽性元素で見られる自由電子による結合を金属結合という。";
seitou[8] = 'm';
kaitou[8] = "";

mondai[9] = "三フッ化ホウ素(Bf<sub>3</sub>)のホウ素原子は、sp2<sup>3</sup>混成軌道からなる。";
seitou[9] = 'm';
kaitou[9] = "";

mondai[10] = "1,2-ジクロロベンゼンの双極子モーメントは、ゼロである。";
seitou[10] = 'b';
kaitou[10] = "ベンゼン上の水素が塩素に置換したため極性分子であり、双極子モーメントはゼロではありません。<br>【補足】1,4-ジクロロベンゼンの双極子モーメントはゼロです。";
