var num_max = 10;
var mondai = [];
var seitou = [];
var kaitou = [];

mondai[1] = "組換え体医薬品は、組換えDNA技術を応用して製造されるペプチド又はタンパク質を有効成分とする。";
seitou[1] = 'm';
kaitou[1] = "";

mondai[2] = "組換え体医薬品は、天然に存在するホルモンと同じ構造を有するもののみである。";
seitou[2] = 'b';
kaitou[2] = "ワクチンやモノクローナル抗体のように生体反応を制御するために設計された医薬品もある。";

mondai[3] = "組換え体医薬品では、従来の生体成分よりも医薬品として望ましい性質が得られる。";
seitou[3] = 'm';
kaitou[3] = "";

mondai[4] = "組換え技術を利用して作成される酵素t-PA(tissue-plasminogen activator)は、血栓溶解薬として使われる。";
seitou[4] = 'm';
kaitou[4] = "";

mondai[5] = "組換え体インスリンでは天然のアミノ酸配列を変化させることで速効性を示すことが可能となった。";
seitou[5] = 'm';
kaitou[5] = "";

mondai[6] = "組換え体エリスロポエチンは構造改変により、投与回数を減らすことが可能になった。";
seitou[6] = 'm';
kaitou[6] = "";

mondai[7] = "抗HER2ヒト化モノクローナル抗体ハーセプチン(トラスツズマブ)は、関節リウマチの治療に使われる。";
seitou[7] = 'b';
kaitou[7] = "HER2過剰発現が確認された乳癌の治療等に使われる。";

mondai[8] = "組換え体医薬品の安全性を保証するためには、最終製品とともに製造プロセスのバリデーションが必要である。";
seitou[8] = 'm';
kaitou[8] = "";

mondai[9] = "組換え体医薬品の品質評価は、化学的性質の検証のみでよい。";
seitou[9] = 'b';
kaitou[9] = "生物学的性質も検証すべきである。";

mondai[10] = "組換え体医薬品は、通常高分子量のタンパク質から構成されており、安全性が高いため検証の必要はない。";
seitou[10] = 'b';
kaitou[10] = "高分子タンパク質が必ずしも安全性が高いわけではないため、生物学的な安全性を検証しなければならない。";