var num_max = 11;
var mondai = [];
var seitou = [];
var kaitou = [];

mondai[1] = "細胞膜の両親媒性脂質の極性部は膜の内側に向き合って存在する。";
seitou[1] = 'b';
kaitou[1] = "細胞膜中では、構成脂質の極性部は膜の外側に存在する。";

mondai[2] = "細胞膜に存在する脂質のうち、リン脂質の割合が最も多い。  ";
seitou[2] = 'm';
kaitou[2] = "";

mondai[3] = "コレステロールは、動物細胞膜の構成成分とはならない。";
seitou[3] = 'b';
kaitou[3] = "コレステロールは両親媒性であり、動物細胞膜の構成成分である。";

mondai[4] = "フリッパーゼはATP加水分解のエネルギーを用いて、脂質のフリップ-フロップを促進する酵素である。";
seitou[4] = 'm';
kaitou[4] = "";

mondai[5] = "細胞膜を構成するリン脂質は、二重膜間で対称的に分布する。";
seitou[5] = 'b';
kaitou[5] = "脂質二重膜間で、リン脂質の分布はそれぞれ異なる。";

mondai[6] = "グリコシルホスファチジルイノシトールは、水溶性のタンパク質を膜につなぎとめるアンカーとして機能する。";
seitou[6] = 'b';
kaitou[6] = "糖脂質や糖タンパク質は、細胞膜の外層側に存在する。";

mondai[7] = "細胞膜中の糖タンパク質は、すべて細胞膜の内層側に存在する。";
seitou[7] = 'b';
kaitou[7] = "糖脂質や糖タンパク質は、細胞膜の外層側に存在する。";

mondai[8] = "受動輸送は、外部からのエネルギー供給を必要としない輸送形態である。";
seitou[8] = 'm';
kaitou[8] = "";

mondai[9] = "能動輸送では、濃度勾配に従った輸送がおこる。";
seitou[9] = 'b';
kaitou[9] = "能動輸送では、濃度勾配に<b>逆らった</b>輸送が起こる";

mondai[10] = "二次性能動輸送は、直接、ATPの加水分解エネルギーを利用する輸送である。";
seitou[10] = 'b';
kaitou[10] = "一次性能動輸送が、直接、ATPの加水分解エネルギーを用いる輸送である。";

mondai[11] = "2つのイオンが同時に動く輸送系には、同一方向へ輸送される共輸送と、反対方向へ輸送される逆輸送がある。";
seitou[11] = 'm';
kaitou[11] = "";