var num_max = 19;
var mondai = [];
var seitou = [];
var kaitou = [];

mondai[1] = "ダニエル電池(Daniell)電池は、亜鉛電極(硫酸亜鉛溶液)および銅電極(硫酸銅電極)を連結した化学電池である。";
seitou[1] = 'm';
kaitou[1] = "";

mondai[2] = "負極では還元反応が起こる。";
seitou[2] = 'b';
kaitou[2] = "負極では酸化反応、正極では還元反応がおこる。";

mondai[3] = "金属の一片をその金属イオンを含む溶液に浸したものを金属電極という。";
seitou[3] = 'm';
kaitou[3] = "金属電極は半電池(電極)の一種である。";

mondai[4] = "2つの半電池から構成され、自発的に電気を発生するものを化学電池という。";
seitou[4] = 'm';
kaitou[4] = "";

mondai[5] = "塩橋を介して接続した電池では、液間電位差を無視できる。";
seitou[5] = 'm';
kaitou[5] = "";

mondai[6] = "標準起電力は反応の自発性の指標となる";
seitou[6] = 'm';
kaitou[6] = "";

mondai[7] = "化学電池の起電力は、電池を構成する2つの半電池間の電位差で表される。";
seitou[7] = 'm';
kaitou[7] = "";

mondai[8] = "1barのH<sub>2</sub>ガスとイオンの平均活量1の塩酸溶液から構成される標準水素電極の標準電位を0Vとする。";
seitou[8] = 'm';
kaitou[8] = "";

mondai[9] = "亜鉛電極/硫酸亜鉛溶液を負極として用いた場合、亜鉛電極から亜鉛イオンが生じる。";
seitou[9] = 'm';
kaitou[9] = "負極では酸化反応がおこる。<br>Zn → Zn<sup>2+</sup> + 2e<sup>-</sup>";

mondai[10] = "ダニエル電池(Zn|Zn<sup>2+</sup>||Cu<sup>2+</sup>|Cu)の25℃における標準起電力は+1.1Vである。ただし、Zn電極、Cu電極の標準電極電位(25℃)はそれぞれ-0.763V、0.337Vとする。";
seitou[10] = 'm';
kaitou[10] = "標準起電力は、電池を構成する2つの半電池の標準電極電位差で表すので、+0.337V-(-0.763V)=+1.1Vとなる。";

mondai[11] = "一定温度、一定圧力において可逆的な電荷移動がおこる場合、標準ギブス(Gibbs)エネルギー変化はΔG=-nFEで表される。ただし、nは関与する電子の化学量論係数、Fはファラデー(Faraday)定数、Eは標準起電力とする。";
seitou[11] = 'm';
kaitou[11] = "";

mondai[12] = "標準起電力Eが正の場合、標準ギブスエネルギー変化ΔGは、ΔG < 0 となり反応は自発的に進行する。";
seitou[12] = 'm';
kaitou[12] = "ΔG=-nFEが成立するため、E>0の場合はΔG<0となる。ただし、nは関与する電子の化学量論係数、Fはファラデー定数とする。";

mondai[13] = "起電力は無機金属飲みに定義される。";
seitou[13] = 'b';
kaitou[13] = "NAD<sup>+</sup>や補酵素Qなど生体系にも酸化還元反応は存在するため、これらも定義される。";

mondai[14] = "半電池還元反応の生物学的標準電位をNAD<sup>+</sup>/NADH(-0.320V)、CH<sub>3</sub>CHO/CH<sub>3</sub>CH<sub>2</sub>OH(-0.197V)とする場合、次の反応は自発的に進行する。<br>NADH + CH<sub>3</sub>CHO + H<sup>+</sup> → NAD<sup>+</sup> + CH<sub>3</sub>CH<sub>2</sub>OH";
seitou[14] = 'm';
kaitou[14] = "全反応から考えると、生物学的標準起電力=(-0.197V)-(-0.320V)=0.123Vとなり、正の値となる。すなわち自発的におこる。";

mondai[15] = "2つの半電池間における電解質濃度の差に基づく電池を濃淡電池という。";
seitou[15] = 'm';
kaitou[15] = "";

mondai[16] = "正極および負極の金属や電解質溶液の種類が同じでも、濃度が異なれば濃淡電池は成立する。";
seitou[16] = 'm';
kaitou[16] = "電解質溶液の濃度が異なると電子の量にも変化が出るため、濃淡電池となる。";

mondai[17] = "濃淡電離では濃度の低い方から高い方へ電子が流れる。";
seitou[17] = 'm';
kaitou[17] = "";

mondai[18] = "水素電池を用いた濃淡電池から、液体のpHを求めることができる。";
seitou[18] = 'm';
kaitou[18] = "pHメータの原理である。";

mondai[19] = "濃淡電池の原理は、生体膜における輸送現象に応用される。";
seitou[19] = 'm';
kaitou[19] = "";
