var num_max = 13;
var mondai = [];
var seitou = [];
var kaitou = [];

mondai[1] = "カルシトニンは、ペプチド性ホルモンの一種である。";
seitou[1] = 'm';
kaitou[1] = "";

mondai[2] = "インスリンは、グリコーゲン分解を促進する。";
seitou[2] = 'b';
kaitou[2] = "インスリンは、血糖値を下げる方向へ作用するので、肝臓でのグリコーゲン分解を抑制する。";

mondai[3] = "バソプレシンは、脳下垂体後葉から分泌される。";
seitou[3] = 'm';
kaitou[3] = "";

mondai[4] = "甲状腺ホルモンは、分子内にフッ素を含んでいる。";
seitou[4] = 'b';
kaitou[4] = "甲状腺ホルモンは分子内にヨウ素を含む。";

mondai[5] = "アドレナリンは、副腎皮質から分泌される。";
seitou[5] = 'b';
kaitou[5] = "アドレナリンは<b>副腎髄質</b>から分泌される。";

mondai[6] = "ドパミンは、プロラクチンの分泌を抑制する。";
seitou[6] = 'm';
kaitou[6] = "プロラクチン放出抑制ホルモン(PRIH)の本体は、ドパミンである。";

mondai[7] = "テストステロンは、ステロイド骨格を有する。";
seitou[7] = 'm';
kaitou[7] = "";

mondai[8] = "グルココルチコイドは、肝臓における糖新生を促進する。";
seitou[8] = 'm';
kaitou[8] = "";

mondai[9] = "副腎皮質ホルモンはトリアシルグリセロールから合成される。";
seitou[9] = 'b';
kaitou[9] = "コレステロールからプレグネノロンを経て生合成される。";

mondai[10] = "アルドステロンは、遠位尿細管におけるNa<sup>+</sup>の分泌を促進する。";
seitou[10] = 'b';
kaitou[10] = "アルドステロンは、遠位尿細管におけるNa<sup>+</sup>の再吸収とK<sup>+</sup>の分泌を促進する。";

mondai[11] = "脳下垂体後葉からのバソプレシンの分泌が欠乏すると腎性尿崩症をおこす。";
seitou[11] = 'b';
kaitou[11] = "バソプレシンの分泌欠乏では、中枢性尿崩症となる。腎性尿崩症は集合管の障害でおこる。";

mondai[12] = "クッシング症候群は、アルドステロンの過剰分泌によりおこる。";
seitou[12] = 'b';
kaitou[12] = "クッシング症候群は、糖質コルチコイドの過剰分泌によりおこる。";

mondai[13] = "甲状腺ホルモンの過剰症では、頻脈、体重減少、眼球突出が見られる。";
seitou[13] = 'm';
kaitou[13] = "";