var num_max = 6;
var mondai = [];
var seitou = [];
var kaitou = [];

mondai[1] = "体内の水分量は、体重の約10%である。";
seitou[1] = 'b';
kaitou[1] = "体内水分量は、体重の約60%である。例えば体重50kgのヒトでは30kgつまり30Lが水分量である。";

mondai[2] = "健常人における血液のpHは7.35~7.45である。";
seitou[2] = 'm';
kaitou[2] = "";

mondai[3] = "Na<sup>+</sup>は、細胞内液と比較して細胞外液に豊富なイオンである。";
seitou[3] = 'm';
kaitou[3] = "";

mondai[4] = "腎臓における尿生成の最小機能単位は、ネフロンである。";
seitou[4] = 'm';
kaitou[4] = "";

mondai[5] = "原尿の主な成分であるNa<sup>+</sup>, H<sub>2</sub>Oは、約99%が尿中に排泄される。";
seitou[5] = 'b';
kaitou[5] = "原尿の大部分が尿細管において再吸収され、約1%が尿中に排泄される。";

mondai[6] = "レニン-アンギオテンシン系の亢進は、血中Na<sup>+</sup>の減少を介して尿量の増加を招く。";
seitou[6] = 'b';
kaitou[6] = "レニン-アンギオテンシン系の亢進により分泌されるアルドステロンは、腎臓の集合管に作用してNa<sup>+</sup>の再吸収とK<sup>+</sup>の分泌を高める。その結果、血中Na<sup>+</sup>の増加を介して尿量の低下を招く。";