var num_max = 15;
var mondai = [];
var seitou = [];
var kaitou = [];

mondai[1] = "吸光度測定法において吸光度は濃度に反比例する。";
seitou[1] = 'b';
kaitou[1] = "ランベルト-ベール(Lanber-Beer)の法則により、吸光度は濃度および層長に比例する。";

mondai[2] = "紫外可視領域の光の吸収は、有機化合物中の主に共役二重結合によるものである。";
seitou[2] = 'm';
kaitou[2] = "主に共役二重結合中のπ電子状態の変化に伴い光を吸収する。";

mondai[3] = "水酸基は助団色と呼ばれ、モル吸光係数を減少させる。";
seitou[3] = 'b';
kaitou[3] = "モル吸光係数を増大させる。";

mondai[4] = "吸光度は溶液中の溶質の濃度が極端に高くなると比例関係がなくなる。";
seitou[4] = 'm';
kaitou[4] = "";

mondai[5] = "光の強度を電気信号に変える測光部には電子倍増菅が用いられている。";
seitou[5] = 'm';
kaitou[5] = "";

mondai[6] = "物質が光を吸収して得たエネルギーを光として放出する現象をフォルトミネッセンスという。";
seitou[6] = 'm';
kaitou[6] = "";

mondai[7] = "一般に、励起極大波長は蛍光極大波長よりも長波長側にある。";
seitou[7] = 'b';
kaitou[7] = "蛍光極大波長の方が長波長側にある。";

mondai[8] = "励起光の波長を変化させながら、ある一定波長での蛍光強度の変化を測定したものを蛍光スペクトルという。";
seitou[8] = 'b';
kaitou[8] = "励起スペクトルの記述である。";

mondai[9] = "傾向は、リン光よりも寿命が短い。";
seitou[9] = 'm';
kaitou[9] = "";

mondai[10] = "アミノ酸に蛍光性をもたせる方法として、オルトフタルアルデヒド方がある。";
seitou[10] = 'm';
kaitou[10] = "アミノ酸は蛍光誘導体化法にはほかにフルオレサミン法、ダンシル法がある。";

mondai[11] = "旋光度測定法は光学活性物質が偏光の偏光面を回転させる現象を利用したものである。";
seitou[11] = 'm';
kaitou[11] = "";

mondai[12] = "旋光度測定法は光学活性物質の定量に利用できる。";
seitou[12] = 'm';
kaitou[12] = "";

mondai[13] = "旋光度が測定波長により変化する現象を円二色性という。";
seitou[13] = 'b';
kaitou[13] = "旋光分散の記述である。";

mondai[14] = "オンタクト則とは旋光分散のコットン(Cotton)効果を応用して光学活性飽和ケトンの構造を経験的に決める方法である。";
seitou[14] = 'm';
kaitou[14] = "";

mondai[15] = "旋光分散スペクトルにより光学活性物質の絶対配置に関する情報が得られる。";
seitou[15] = 'm';
kaitou[15] = "";
