var num_max = 20;
var mondai = [];
var seitou = [];
var kaitou = [];

mondai[1] = "塩化ナトリウムの結合は共有結合である。";
seitou[1] = 'b';
kaitou[1] = "<b>イオン結合</b>である。";

mondai[2] = "アンモニアのN-H結合は共有結合である。";
seitou[2] = 'm';
kaitou[2] = "";

mondai[3] = "水素化ナトリウムでは、水素は負に分極している。";
seitou[3] = 'm';
kaitou[3] = "";

mondai[4] = "窒素分子の結合に、σ結合は含まれない。";
seitou[4] = 'b';
kaitou[4] = "すべての共有結合において、σ結合は必ず1本含まれる。";

mondai[5] = "アンモニアの窒素原子の非共有電子対は、プロトンと配位結合する。";
seitou[5] = 'm';
kaitou[5] = "";

mondai[6] = "エタンのC-H結合はσ結合である。";
seitou[6] = 'm';
kaitou[6] = "";

mondai[7] = "エチレンの二重結合はイオン結合である。";
seitou[7] = 'b';
kaitou[7] = "エチレンの二重結合は共に共有結合であり、σ結合とπ結合である。";

mondai[8] = "陽性元素で見られる自由電子による結合を金属結合という。";
seitou[8] = 'm';
kaitou[8] = "";

mondai[9] = "三フッ化ホウ素(Bf<sub>3</sub>)のホウ素原子は、sp2<sup>3</sup>混成軌道からなる。";
seitou[9] = 'm';
kaitou[9] = "";

mondai[10] = "ピリジンの窒素原子の非共有電子対は、sp<sup>2</sup>混成軌道に収容されている。";
seitou[10] = 'm';
kaitou[10] = "";

mondai[11] = "アレン(H<sub>2</sub>C=C=CH<sub>2</sub>)の炭素原子の軌道は、すべてsp<sup>2</sup>混成軌道からなる。";
seitou[11] = 'b';
kaitou[11] = "アレンの中央炭素原子はsp混成軌道をとり、両末端の炭素原子はsp<sub>2</sub>混成軌道をとる。";

mondai[12] = "メチルカチオンの炭素原子は、sp<sup>2</sup>混成軌道を持つ。";
seitou[12] = 'm';
kaitou[12] = "";

mondai[13] = "水素分子の分子軌道において、基底状態では反結合性軌道に電子は収容されていない。";
seitou[13] = 'm';
kaitou[13] = "";

mondai[14] = "COは等核二原子分子である。";
seitou[14] = 'b';
kaitou[14] = "2つの異なる元素からできているものは異核二原子分子である。";

mondai[15] = "ブタ-1,3-ジエンは2つの二重結合を持つため、π結合の分子軌道は2つ存在する。";
seitou[15] = 'b';
kaitou[15] = "ブタ-1,3-ジエンは4つのp軌道をもつため、π結合の分子軌道は4つ形成される。";

mondai[16] = "電子が収容されていない軌道のうち、最もエネルギー順位が低い軌道を最低空軌道という。";
seitou[16] = 'm';
kaitou[16] = "";

mondai[17] = "ベンゼンのπ軌道は非局在化している。";
seitou[17] = 'm';
kaitou[17] = "";

mondai[18] = "ブタ-1,3-ジエンは共役系分子である。";
seitou[18] = 'm';
kaitou[18] = "";

mondai[19] = "酢酸の共役塩基は共鳴安定化を受けている。";
seitou[19] = 'm';
kaitou[19] = "";

mondai[20] = "アセトンのケト型とエノール型は、互いに共鳴構造である。";
seitou[20] = 'b';
kaitou[20] = "ケト型とエノール型は、互いに共鳴構造ではなく、互変異性の関係である。";
