var num_max = 10;
var mondai = [];
var seitou = [];
var kaitou = [];

mondai[1] = "g(グラム)はSI基本単位である。";
seitou[1] = 'b';
kaitou[1] = "SI基本単位系において質量の単位はkg(キログラム)です。";

mondai[2] = "J(ジュール)はSI基本単位系である。";
seitou[2] = 'b';
kaitou[2] = "J(ジュール)はSI基本単位系でありません。1J = 1N・mです。(第100回)";

mondai[3] = "三フッ化ホウ素(BF<sub>3</sub>)のホウ素原子はsp<sup>2</sup>混成軌道をもつ。";
seitou[3] = 'm';
kaitou[3] = "sp<sup>2</sup>混成軌道に加え、空のp軌道をもっています。";

mondai[4] = "アンモニアの窒素原子はsp<sup>2</sup>混成軌道をもち、分子全体はほぼ平面構造である。";
seitou[4] = 'b';
kaitou[4] = "アンモニアの窒素原子はsp<sup>3</sup>混成軌道をもちます。そのため四面体構造となります。";

mondai[5] = "1s軌道と3つの2p軌道が混成して、sp<sup>3</sup>混成軌道が形成される。";
seitou[5] = 'b';
kaitou[5] = "sp<sup>3</sup>混成軌道を形成する時は「2s軌道」と3つの2p軌道が混成します。";

mondai[6] = "ボラン(BH<sub>3</sub>)のホウ素原子は、sp<sup>2</sup>混成である。";
seitou[6] = 'm';
kaitou[6] = "ボラン(BH<sub>3</sub>)のホウ素原子は、sp<sup>2</sup>混成です。また、空のp軌道を1つもちます。";

mondai[7] = "アンモニアの方が水よりも結合角が大きい。";
seitou[7] = 'm';
kaitou[7] = "水は2つの非共有電子対を持つため反発が大きく、結合角が小さくなります。";

mondai[8] = "メチルアニオンの方がメチルカチオンよりも結合角が大きい。";
seitou[8] = 'b';
kaitou[8] = "メチルアニオンの炭素はsp<sup>3</sup>混成軌道、メチルラジカルの炭素はsp<sup>2</sup>混成軌道をとります。";

mondai[9] = "ケト-エノール互変異性体は、共鳴の関係にある。";
seitou[9] = 'b';
kaitou[9] = "ケト-エノール互変異性体は、共鳴の関係ではありません。共鳴の条件として原子の位置は変化しません。";

mondai[10] = "1,2-ジクロロベンゼンの双極子モーメントは、ゼロである。";
seitou[10] = 'b';
kaitou[10] = "ベンゼン上の水素が塩素に置換したため極性分子であり、双極子モーメントはゼロではありません。<br>【補足】1,4-ジクロロベンゼンの双極子モーメントはゼロです。";
