var num_max = 13;
var mondai = [];
var seitou = [];
var kaitou = [];

mondai[1] = "I型アレルギーはハウスダスト、花粉、ダニ、卵、牛乳など通常無害である物質に対してIgGが産生される場合におこる。";
seitou[1] = 'b';
kaitou[1] = "I型アレルギーはIgEが産生される場合におこる。";

mondai[2] = "新生児溶血性貧血はII型アレルギーの機序でおこる。";
seitou[2] = 'm';
kaitou[2] = "";

mondai[3] = "III型アレルギーは、抗体が抗原同士を結びつけてできた免疫複合体が組織に沈着し、それにT細胞が反応することによっておこる。";
seitou[3] = 'b';
kaitou[3] = "組織に沈着した免疫複合体に好中球は反応して、タンパク質分解酵素、活性酸素などを放出することによって周辺組織が障害される。";

mondai[4] = "IVアレルギーはT細胞は関与する産生するサイトカインによる組織傷害で、抗体は関与しない。";
seitou[4] = 'm';
kaitou[4] = "";

mondai[5] = "炎症の五代兆候は、発赤、熱感、腫脹、疼痛及び機能障害である。";
seitou[5] = 'm';
kaitou[5] = "";

mondai[6] = "炎症とは微生物や、物理的・化学的刺激などによって組織が障害されたときに見られる生体の防御反応である。";
seitou[6] = 'm';
kaitou[6] = "";

mondai[7] = "IL-1,IL-8,TNF-αは炎症に関与するサイトカインである。";
seitou[7] = 'm';
kaitou[7] = "";

mondai[8] = "関節リウマチは、核と抗核抗体の複合体によって組織が障害される全身性の自己免疫疾患である。";
seitou[8] = 'b';
kaitou[8] = "全身性エリテマトーデスに関する記述である。関節リウマチはIgGに対する自己抗体がつくられることが原因である。";

mondai[9] = "重症筋無力症では、筋肉のアセチルコリン受容体に対する抗体がつくられ、筋肉の収縮がおこらなくなる。";
seitou[9] = 'm';
kaitou[9] = "";

mondai[10] = "慢性甲状腺炎では、甲状腺刺激ホルモン(TSH)受容体に対する抗体がつくられ、受容体の機能が亢進する。";
seitou[10] = 'b';
kaitou[10] = "慢性甲状腺炎ではなくバセドウ病に関する記述である。";

mondai[11] = "レトロウイルスの感染により免疫不全がおこる。";
seitou[11] = 'm';
kaitou[11] = "";

mondai[12] = "ヘルパーT細胞の数が減少することで免疫不全がおこる。";
seitou[12] = 'm';
kaitou[12] = "";

mondai[13] = "重症複合免疫不全症(SCID)では体液性免疫も細胞性免疫も低下する。";
seitou[13] = 'm';
kaitou[13] = "";