var num_max = 14;
var mondai = [];
var seitou = [];
var kaitou = [];

mondai[1] = "免疫応答は、主として赤血球によって担われる。";
seitou[1] = 'b';
kaitou[1] = "主に白血球によって担われる。";

mondai[2] = "リンパ器官には骨髄、胸腺、脾臓、リンパ節、リンパ管などがある。";
seitou[2] = 'm';
kaitou[2] = "";

mondai[3] = "ヒトでは免疫を担当するリンパ球は骨髄幹細胞より産生される。";
seitou[3] = 'm';
kaitou[3] = "";

mondai[4] = "細胞性免疫を担当するT細胞は骨髄で成熟・分化する。";
seitou[4] = 'b';
kaitou[4] = "T細胞は胸腺で、B細胞は骨髄で成熟・分化する。";

mondai[5] = "ヘルパーT細胞には、主に体液性免疫を導くサイトカインを産生するTh1細胞と、主に細胞性免疫を導くサイトカインを産生するTh2細胞がある。";
seitou[5] = 'b';
kaitou[5] = "Th1細胞は細胞性免疫を、またTh2細胞は体液性免疫を導くサイトカインを産生する。";

mondai[6] = "樹状細胞やマクロファージは抗原提示細胞である。";
seitou[6] = 'm';
kaitou[6] = "";

mondai[7] = "T細胞やB細胞は1つの細胞につき1種類の抗原受容体を発現している。";
seitou[7] = 'm';
kaitou[7] = "";

mondai[8] = "キラーT細胞(細胞障害性T細胞)やナチュラルキラー細胞(NK細胞)は、ウイルス完成細胞を破壊できる。";
seitou[8] = 'm';
kaitou[8] = "";

mondai[9] = "好中球やマクロファージは貪食能を有する細胞である。";
seitou[9] = 'm';
kaitou[9] = "";

mondai[10] = "マクロファージは微生物を認識する受容体をもたない。";
seitou[10] = 'b';
kaitou[10] = "マクロファージは微生物に広く共通して存在する物質に対する受容体をもつ。";

mondai[11] = "好中球は抗体のFc部に対する受容体を発現しており、オプソニン化された細菌を貪食し消化する。";
seitou[11] = 'm';
kaitou[11] = "";

mondai[12] = "骨髄や胸腺で成熟したリンパ球は、血液を介して全身の二次リンパ器官に分布し、そこに定着し再び全身を循環することはない。";
seitou[12] = 'b';
kaitou[12] = "リンパ球はリンパ液と血液を介して全身を循環している。";

mondai[13] = "リンパ球の血管外への遊走には、接着分子とケモカインが関与している。";
seitou[13] = 'm';
kaitou[13] = "";

mondai[14] = "T細胞は、MHC抗原に結合した抗原情報を認識できる。";
seitou[14] = 'm';
kaitou[14] = "";