var num_max = 10;
var mondai = [];
var seitou = [];
var kaitou = [];

mondai[1] = "グルコースはケトースに分類される。";
seitou[1] = 'b';
kaitou[1] = "グルコースはアルドースである。";

mondai[2] = "D-グルコースとL-グルコースは互いに鏡像異性体の関係にある。";
seitou[2] = 'm';
kaitou[2] = "";

mondai[3] = "グルコースの水溶液は変旋光を示す";
seitou[3] = 'm';
kaitou[3] = "";

mondai[4] = "天然に存在するグルコースはL体である。";
seitou[4] = 'b';
kaitou[4] = "天然の単糖はほとんどD体である。";

mondai[5] = "ソルビトールは、グルコースのヒドロキシメチル基を酸化して得られる。";
seitou[5] = 'b';
kaitou[5] = "ソルビトールは、グルコースの1位のアルデヒド基を還元して得られる糖アルコールである。";

mondai[6] = "鎖状のグルクロン酸は還元性を示す。";
seitou[6] = 'm';
kaitou[6] = "";

mondai[7] = "ショ糖は、還元性および変旋光を示す。";
seitou[7] = 'b';
kaitou[7] = "ショ糖(スクロース)は、構成糖のアノマー水酸基同士が結合しているので、還元性及び変旋光を示さない。";

mondai[8] = "グリコーゲンは植物の貯蔵多糖である。";
seitou[8] = 'b';
kaitou[8] = "グリコーゲンは<b>動物</b>の貯蔵多糖である。";

mondai[9] = "アミロース及びセルロースはヒトの消化酵素によってグルコースへ分解される。";
seitou[9] = 'b';
kaitou[9] = "セルロースは、グルコースがβ(1→4)結合した多糖であるが、ヒトはセルラーぜをもたないため、分解できない。";

mondai[10] = "アミロペクチンは直鎖構造のみを含む。";
seitou[10] = 'b';
kaitou[10] = "アミロペクチンは分岐構造も含む。";