var num_max = 16;
var mondai = [];
var seitou = [];
var kaitou = [];

mondai[1] = "酵素の本体は、一般にタンパク質である。";
seitou[1] = 'm';
kaitou[1] = "";

mondai[2] = "酵素活性は、温度やpHの影響を受けるが、塩濃度の影響は受けない。";
seitou[2] = 'b';
kaitou[2] = "塩濃度の影響も受ける。";

mondai[3] = "酵素濃度が一定で基質濃度が低い場合、酵素反応速度は基質濃度に依存する。";
seitou[3] = 'm';
kaitou[3] = "";

mondai[4] = "トリプシンの最適pHは弱アルカリ性付近である。";
seitou[4] = 'm';
kaitou[4] = "";

mondai[5] = "アミノ基転位酵素はアミノ酸のアミノ基をα-ケト酸に転移させる。";
seitou[5] = 'm';
kaitou[5] = "";

mondai[6] = "酸化還元酵素の例としてアルコール脱水素酵素がある。";
seitou[6] = 'm';
kaitou[6] = "";

mondai[7] = "グリコーゲンホスホリラーゼはグリコーゲンを加水分解する。";
seitou[7] = 'b';
kaitou[7] = "グリコーゲンホスホリラーゼは加リン酸分解酵素である。";

mondai[8] = "補酵素とは、酵素と結合してその酵素の触媒作用を発揮させる有機化合物である。";
seitou[8] = 'm';
kaitou[8] = "";

mondai[9] = "グルタチオンペルオキシダーゼは鉄を含む。";
seitou[9] = 'b';
kaitou[9] = "グルタチオンペルオキシダーゼは<b>セレン</b>を含む。";

mondai[10] = "カタラーゼには銅が含まれている。";
seitou[10] = '';
kaitou[10] = "カタラーゼには<b>鉄</b>が含まれている。";

mondai[11] = "ミカエリス定数(K<sub>m</sub>)は、最大反応速度(V<sub>max</sub>)の1/2の速度を与える基質濃度のことである。";
seitou[11] = 'm';
kaitou[11] = "";

mondai[12] = "ミカエリス定数は、酵素と基質の親和性を表す定数である。";
seitou[12] = 'm';
kaitou[12] = "";

mondai[13] = "ミカエリス定数が小さいほど、酵素と基質の親和性は高い。";
seitou[13] = 'm';
kaitou[13] = "";

mondai[14] = "ある代謝酵素の最終産物が、その経路の上流に位置する特定の酵素を阻害する現象をフィードバック阻害という。";
seitou[14] = 'm';
kaitou[14] = "";

mondai[15] = "アロステリック酵素には調節因子が結合する領域が存在する。";
seitou[15] = 'm';
kaitou[15] = "";

mondai[16] = "アロステリック酵素が受ける基質濃度の影響はミカエリス・メンテンの式に従う。";
seitou[16] = 'b';
kaitou[16] = "ミカエリス・メンテンの式には従わない。";