var num_max = 25;
var mondai = [];
var seitou = [];
var kaitou = [];

mondai[1] = "グリコーゲンは、グルコースからグルコース-6-リン酸を介して生成される。";
seitou[1] = 'm';
kaitou[1] = "";

mondai[2] = "肝臓のグリコーゲンは、グルコース-6-リン酸を介してグルコースに変換される。";
seitou[2] = 'm';
kaitou[2] = "一方、筋肉細胞では、グルコース6-ホスファターゼをもたないため、グルコースに変換することはできない。";

mondai[3] = "グリコーゲンは、グリコーゲンホスホリラーゼにより加リン酸分解される。";
seitou[3] = 'm';
kaitou[3] = "";

mondai[4] = "糖新生は、乳酸、ピルビン酸、グリセロール、アミノ酸などの物質からグルコースを産生する経路である。";
seitou[4] = 'm';
kaitou[4] = "";

mondai[5] = "筋肉で生じた乳酸は、筋肉内で糖新生を受ける。";
seitou[5] = 'b';
kaitou[5] = "筋肉で生じた乳酸は、血流を介して肝臓に運ばれ、肝臓でグルコースに変換される。";

mondai[6] = "アラニンは、肝臓でピルビン酸を経てグルコースに変換される。";
seitou[6] = 'm';
kaitou[6] = "";

mondai[7] = "飢餓状態では、糖原性アミノ酸からグルコースが生成する。";
seitou[7] = 'm';
kaitou[7] = "";

mondai[8] = "飢餓状態で増加するケトン体は、主に肝臓で産生される。";
seitou[8] = 'm';
kaitou[8] = "";

mondai[9] = "ケトン体は、アセトン、アセト酢酸、β-ヒドロキシ酪酸の総称である。";
seitou[9] = 'm';
kaitou[9] = "";

mondai[10] = "飢餓状態では、アシドーシスをおこすことがある。";
seitou[10] = 'm';
kaitou[10] = "";

mondai[11] = "インスリンは、肝臓におけるトリアシルグリセロールの分解を促進する。";
seitou[11] = 'b';
kaitou[11] = "インスリンは、肝臓におけるトリアシルグリセロールの<b>合成</b>を促進する。";

mondai[12] = "肝臓で合成されたトリアシルグリセロールは、血中に超低比重リポタンパク質(VLDL)として放出される。";
seitou[12] = 'm';
kaitou[12] = "";

mondai[13] = "脂肪細胞には主にコレステロールが貯蔵される。";
seitou[13] = 'b';
kaitou[13] = "脂肪細胞には主に<b>トリアシルグリセロール</b>が貯蔵される。";

mondai[14] = "ヒトの血糖値は、食事により上昇する。";
seitou[14] = 'm';
kaitou[14] = "";

mondai[15] = "グルカゴンは、血中グルコースの細胞内取込みを促進する。";
seitou[15] = 'b';
kaitou[15] = "血中グルコースの細胞内取込みは、<b>インスリン</b>によって促進される。";

mondai[16] = "血糖値の低下により、脳や神経機能に障害が現れることがある。";
seitou[16] = 'm';
kaitou[16] = "";

mondai[17] = "グルカゴンは、膵臓のランゲルハンス島D細胞で産生される。";
seitou[17] = 'b';
kaitou[17] = "グルカゴンは膵臓のランゲルハンス島<b>A細胞</b>で産生される。";

mondai[18] = "インスリンは、膵臓のランゲルハンス島B細胞で産生される。";
seitou[18] = 'm';
kaitou[18] = "";

mondai[19] = "インスリンの分泌は、ソマトスタチンによって抑制される。";
seitou[19] = 'm';
kaitou[19] = "";

mondai[20] = "アセチルCoAの炭酸固定反応でマロニルCoAが生じる。";
seitou[20] = 'm';
kaitou[20] = "";

mondai[21] = "脂肪酸の伸長反応は、炭素数2個ずつで伸長していく。";
seitou[21] = 'm';
kaitou[21] = "";

mondai[22] = "脂肪酸合成に必要なNADPHはペントースリン酸回路から供給される。";
seitou[22] = 'm';
kaitou[22] = "";

mondai[23] = "アスパラギン酸は、オキサロ酢酸を経てグルコースに変換できる。";
seitou[23] = 'm';
kaitou[23] = "";

mondai[24] = "ロイシンは、ケト原性アミノ酸の1つである。";
seitou[24] = 'm';
kaitou[24] = "";

mondai[25] = "アラニンは、糖原性アミノ酸の1つである。";
seitou[25] = 'm';
kaitou[25] = "";