var num_max = 15;
var mondai = [];
var seitou = [];
var kaitou = [];

mondai[1] = "拡散に関するフィックの(Fick)の第一法則は、物質の流束が濃度勾配に比例することを示したものである。";
seitou[1] = 'm';
kaitou[1] = "";

mondai[2] = "生体膜における濃度勾配による膜透過は能動輸送である。";
seitou[2] = 'b';
kaitou[2] = "濃度勾配による移動は受動拡散である。";

mondai[3] = "単位面積、単位時間あたりの溶質の通過量を流束という。";
seitou[3] = 'm';
kaitou[3] = "";

mondai[4] = "拡散定数は溶媒の年度に反比例する。";
seitou[4] = 'm';
kaitou[4] = "";

mondai[5] = "拡散定数は絶対温度に比例する。";
seitou[5] = 'm';
kaitou[5] = "";

mondai[6] = "固体の溶解が拡散律速で進行するとき、固体の溶解速度はノイエス・ホイットニー(Noyes-Whitney)の式で表される。";
seitou[6] = 'm';
kaitou[6] = "";

mondai[7] = "ネルンスト・ノイエス・ホイットニーの式は拡散律速を仮定している。";
seitou[7] = 'm';
kaitou[7] = "";

mondai[8] = "沈降速度式にストークス(Stokes)の式がある。";
seitou[8] = 'm';
kaitou[8] = "";

mondai[9] = "粒子の沈降と拡散が平衡状態であることを沈降平衡という。";
seitou[9] = 'm';
kaitou[9] = "";

mondai[10] = "粒子の沈降速度は粒子径が大きいほど速くなる。";
seitou[10] = 'm';
kaitou[10] = "";

mondai[11] = "粒子の沈降速度は溶媒の粘度が大きほど速くなる。";
seitou[11] = 'b';
kaitou[11] = "沈降速度と溶媒の粘度は反比例する。";

mondai[12] = "ニュートン(Newton)流動はせん断速度-せん断応力のレオグラムが原点を通る直線を示す。";
seitou[12] = 'm';
kaitou[12] = "";

mondai[13] = "準粘性流動は非ニュートン流動の１つである。";
seitou[13] = 'm';
kaitou[13] = "";

mondai[14] = "毛細管粘度計は、主に非ニュートン液体に適用される。";
seitou[14] = 'b';
kaitou[14] = "毛細管粘度計は動粘度の測定でニュートン液体に、回転粘度計は粘度の測定でニュートン液体、非ニュートン液体に適用される。";

mondai[15] = "高分子溶液の極限粘度から、高分子の平均分子量が求められる。";
seitou[15] = 'm';
kaitou[15] = "";
