var num_max = 16;
var mondai = [];
var seitou = [];
var kaitou = [];

mondai[1] = "薬物の作用は用量に依存しており、低用量から高用量になるに従って、薬理作用、毒性を発現する。";
seitou[1] = 'm';
kaitou[1] = "";

mondai[2] = "有効量(治療量)の最低量を最小有効量という。";
seitou[2] = 'm';
kaitou[2] = "";

mondai[3] = "中毒症状を示す量を極量という。";
seitou[3] = 'b';
kaitou[3] = "極量は、中毒症状を示す直前の量である。";

mondai[4] = "薬物は治療量で主作用や副作用を発現し、中毒量や致死量では毒性を発現する。";
seitou[4] = 'm';
kaitou[4] = "";

mondai[5] = "薬物作用の中で、治療上好ましい作用を主作用といい、それ以外の作用を副作用という。";
seitou[5] = 'm';
kaitou[5] = "";

mondai[6] = "薬物が最大の作用を発現する用量を最大有効量という。";
seitou[6] = 'm';
kaitou[6] = "";

mondai[7] = "用量-反応曲線は、横軸の用量を対数目盛りにすると、通常シグモイド曲線となる。";
seitou[7] = 'm';
kaitou[7] = "";

mondai[8] = "縦軸に反応する個体の割合を累積反応としてプロットしたものが、累積用量-反応曲線である。";
seitou[8] = 'm';
kaitou[8] = "";

mondai[9] = "ED<sub>50</sub>値は、薬物を投与した一群の動物の50%において、基準と定めた効果を発現すると推定される薬物の用量である。";
seitou[9] = 'm';
kaitou[9] = "";

mondai[10] = "治療係数(安全係数)は、高い値であればあるほど、その薬物の安全性が高いことを意味する。";
seitou[10] = 'm';
kaitou[10] = "";

mondai[11] = "治療係数(安全係数)は、LD<sub>50</sub>/ED<sub>50</sub>で表され、安全性の1つの指標となる。";
seitou[11] = 'm';
kaitou[11] = "";

mondai[12] = "主作用と副作用は、患者の状態によって、すなわち治療目的により決定されることがある。";
seitou[12] = 'm';
kaitou[12] = "";

mondai[13] = "抗ヒスタミン薬の鎮静作用は、常に副作用である。";
seitou[13] = 'b';
kaitou[13] = "睡眠が障害されている患者にとっては、主作用となる。";

mondai[14] = "麻酔性鎮痛薬モルヒネのもつ止瀉作用は、副作用にも主作用にもなる。";
seitou[14] = 'm';
kaitou[14] = "";

mondai[15] = "一般に、主作用以外の作用であっても、患者にとって不都合出ない場合は、特に副作用とはよばない。";
seitou[15] = 'm';
kaitou[15] = "";

mondai[16] = "有害事象は、薬物との因果関係がはっきりとしないものを含めた好ましくない作用のことである。";
seitou[16] = 'm';
kaitou[16] = "";