var num_max = 29;
var mondai = [];
var seitou = [];
var kaitou = [];

mondai[1] = "陰イオンや中性化合物がそれらのもつ非共有電子対で金属イオンと配位した化合物を錯体という。";
seitou[1] = 'm';
kaitou[1] = "";

mondai[2] = "非共有電子対を金属イオンに与える分子やイオンを配位子という。";
seitou[2] = 'm';
kaitou[2] = "";

mondai[3] = "エチレンジアミン四酢酸は二座配位子である。";
seitou[3] = 'b';
kaitou[3] = "エチレンジアミン四酢酸は六座配位子である。";

mondai[4] = "配位子が中心金属イオンと結合してできる環構造をキレート環という。";
seitou[4] = 'm';
kaitou[4] = "";

mondai[5] = "ビタミンCはキレート化合物の代表的な医薬品である。";
seitou[5] = 'b';
kaitou[5] = "代表的なキレート化合物はビタミンB<sub>12</sub>(シアノコバラミンなど)である。";

mondai[6] = "溶解度とは、一定量の溶媒に溶ける溶質の最大量のことである。";
seitou[6] = 'm';
kaitou[6] = "";

mondai[7] = "難溶性塩AgClの溶解度Sと溶解度積K<sub>sp</sub>の間にはK<sub>sp</sub>=S<sup>2</sup>の関係がる。";
seitou[7] = 'm';
kaitou[7] = "";

mondai[8] = "共通イオン効果とは、難溶性塩の飽和水溶液に共通イオンを加えると、難溶性塩の溶解度が著しく増加することである。";
seitou[8] = 'b';
kaitou[8] = "減少することである。";

mondai[9] = "異種イオン効果とは、溶液中に沈殿物と無関係なイオンが多量に存在すると、沈殿物の溶解度が減少することである。";
seitou[9] = 'b';
kaitou[9] = "増加することである。";

mondai[10] = "共存する塩同士をそれぞれの溶解度の差に基づいて沈殿として分離する操作を分別沈殿という。";
seitou[10] = 'm';
kaitou[10] = "";

mondai[11] = "イオン、原子や分子などの化学種が電子を失う反応を酸化という。";
seitou[11] = 'm';
kaitou[11] = "";

mondai[12] = "金属片を活量1の同じ金属イオン溶液に浸したときに、金属片と溶液の間に生じる電位差を標準電極電位という。";
seitou[12] = 'm';
kaitou[12] = "";

mondai[13] = "金属の標準酸化還元電位の決定に、標準水素電極が用いられる。";
seitou[13] = 'm';
kaitou[13] = "";

mondai[14] = "ネルンスト(Nernst)の式とは、半電池反応の単極電位と標準酸化還元電位および酸化体、還元体の濃度の関係を示した式である。";
seitou[14] = 'm';
kaitou[14] = "";

mondai[15] = "金属片をその金属イオン溶液に浸したときの電位は、金属イオン濃度に影響を受ける。";
seitou[15] = 'm';
kaitou[15] = "";

mondai[16] = "水素イオンが関係する酸化還元反応では、系の酸化還元電位がpHにより変化する。";
seitou[16] = 'm';
kaitou[16] = "";

mondai[17] = "酸化還元反応の平衡定数はネルンストの式により算出することができる。";
seitou[17] = 'm';
kaitou[17] = "";

mondai[18] = "イオン化傾向が小さいほど、イオンは還元され金属として析出しやすくなる。";
seitou[18] = 'm';
kaitou[18] = "";

mondai[19] = "標準酸化還元反応電位が負の値をもつ金属は、特にイオン化傾向が大きい。";
seitou[19] = 'm';
kaitou[19] = "";

mondai[20] = "分配係数とは、互いに混ざり合わない2種類の溶媒間で分配平衡に達している溶質の濃度比である。";
seitou[20] = 'm';
kaitou[20] = "";

mondai[21] = "油/水分配係数が大きいほど、脂溶性が高い薬物である。";
seitou[21] = 'm';
kaitou[21] = "";

mondai[22] = "同じ物質の水溶液を同量のベンゼンで抽出する際、抽出回数を増やした方が抽出効率はよい。";
seitou[22] = 'm';
kaitou[22] = "";

mondai[23] = "弱酸のみかけの分配係数は、水相のpHが小さいほど小さくなる。";
seitou[23] = 'b';
kaitou[23] = "水相のpHが小さいと分子形分率が増加するため、みかけの分配係数は大きくなり、真の分配係数に近づく。";

mondai[24] = "弱酸の真の分配係数は、水相のpHが小さいほど小さくなる。";
seitou[24] = 'b';
kaitou[24] = "真の分配係数はpHの影響を受けない。";

mondai[25] = "交換基としてスルホン酸をもつのは、陰イオン交換樹脂である。";
seitou[25] = 'b';
kaitou[25] = "陽イオン交換樹脂である。";

mondai[26] = "イオン交換樹脂1gがイオン交換しうる最大の交換量を交換容量という。";
seitou[26] = 'm';
kaitou[26] = "";

mondai[27] = "陰イオン交換基としては第四級アンモニウム塩や第三級アミンが用いられる。";
seitou[27] = 'm';
kaitou[27] = "";

mondai[28] = "イオン交換体に対する吸着性は、吸着されるイオンの電荷が小さいほど高い。";
seitou[28] = 'b';
kaitou[28] = "電荷が大きほど吸着性は高い。";

mondai[29] = "電荷が等しい同族のイオンでは、水和イオン半径が大きほどイオン交換樹脂への吸着性が高い。";
seitou[29] = 'b';
kaitou[29] = "吸着性が低い。";
