var num_max = 10;
var mondai = [];
var seitou = [];
var kaitou = [];

mondai[1] = "中毒が疑われる救急患者の中毒物質を解明するときには臓器も重要な試料となる。";
seitou[1] = 'b';
kaitou[1] = "臓器が対象試料となるのは死亡患者である。";

mondai[2] = "胃内容物、血液、尿、唾液などのすべての試料に原因物質は常に存在する。";
seitou[2] = 'b';
kaitou[2] = "中毒発症までの時間にもよるが、すべてに存在するとは限らない。";

mondai[3] = "中毒原因物質が組み合わされていることもあるため、複数の原因物質の存在にも配慮して取り扱う。";
seitou[3] = 'm';
kaitou[3] = "";

mondai[4] = "除草剤には青色色素が添加されているものもあるため、胃内容物の色に注意する。";
seitou[4] = 'm';
kaitou[4] = "誤飲防止用に催吐剤を含有したものがある。";

mondai[5] = "中毒物質によっては尿のpHによって排泄速度が大きく異なるため注意が必要である。";
seitou[5] = 'm';
kaitou[5] = "";

mondai[6] = "尿糖やケトン体は尿検査スティックを用いて検査できる。";
seitou[6] = 'm';
kaitou[6] = "陽性であれば、アセトン中毒、飢餓の疑いがある。";

mondai[7] = "胃内容物の水銀塩のスクリーニングにはシェーンバイン・パーゲンステッヘル方が用いられる。";
seitou[7] = 'b';
kaitou[7] = "水銀塩には、ラインシュ法が用いられる。シェーンバイン・パーゲンステッヘル法は青酸塩のスクリーニング法である。";

mondai[8] = "クロロホルム、抱水クロラールなどトリクロロ化合物の検出は藤原反応により行われる。";
seitou[8] = 'm';
kaitou[8] = "";

mondai[9] = "血糖測定で高血糖の場合はインスリン、エタノールの過剰摂取が疑われる。";
seitou[9] = 'b';
kaitou[9] = "インスリンやエタノールの過剰摂取では低血糖が疑われる。";

mondai[10] = "フェノチアジン系精神安定剤は試料抽出物の薄層クロマトグラフィーでの展開後、硫酸発色法で加熱する前に特異的な赤・橙・紫・青色のスポットを呈する。";
seitou[10] = 'm';
kaitou[10] = "";
