var num_max = 8;
var mondai = [];
var seitou = [];
var kaitou = [];

mondai[1] = "二次免疫応答では、一次免疫応答より速やかに大量のIgMが産生される。";
seitou[1] = 'b';
kaitou[1] = "IgGに関する記述である。";

mondai[2] = "ワクチンは細胞性免疫を誘導することができない。";
seitou[2] = 'b';
kaitou[2] = "細胞性免疫を誘導できる。";

mondai[3] = "生ワクチンは弱毒化した病原体を生きたまま接種するので、体内で毒性が回復する可能性がある。";
seitou[3] = 'm';
kaitou[3] = "";

mondai[4] = "不活化ワクチンは安全であるが、体液性免疫を誘導できない。";
seitou[4] = 'b';
kaitou[4] = "不活化ワクチンは細胞性免疫を誘導できない。";

mondai[5] = "アジュバントは、ワクチンの免疫応答を高める目的で投与される。";
seitou[5] = 'm';
kaitou[5] = "";

mondai[6] = "インフルエンザワクチンに使用されるウイルス株は流行状況を考慮して毎年決定する。";
seitou[6] = 'm';
kaitou[6] = "";

mondai[7] = "B型肝炎キャリアの母親から生まれた子に母子感染予防の目的で免疫グロブリン及びB型肝炎ワクチンの接種が実施されている。";
seitou[7] = 'm';
kaitou[7] = "";

mondai[8] = "妊婦は麻疹、風疹の予防接種を受けることができる。";
seitou[8] = 'b';
kaitou[8] = "生ワクチンであるため妊婦は接種不適当者である。";