var num_max = 19;
var mondai = [];
var seitou = [];
var kaitou = [];

mondai[1] = "生体が異物の刺激により得られる(抗原)特異的な免疫を獲得免疫という。";
seitou[1] = 'm';
kaitou[1] = "";

mondai[2] = "生体が異物に対して先天的に有している抵抗性を自然免疫という。";
seitou[2] = 'm';
kaitou[2] = "";

mondai[3] = "抗原に繰り返しばく露されても、獲得免疫による抵抗性が高まることはない。";
seitou[3] = 'b';
kaitou[3] = "獲得免疫では、一部のリンパ球が記憶細胞となるため、初回よりもさらに強い抵抗性を示す。";

mondai[4] = "樹状細胞のもつ抗原提示作用は、獲得免疫の誘導に関与する。";
seitou[4] = 'm';
kaitou[4] = "樹状細胞やマクロファージなどの抗原提示細胞は、獲得免疫の誘導に関与する。";

mondai[5] = "正常な皮膚の角質層は、病原体の侵入を阻む物理的なバリアーである。";
seitou[5] = 'm';
kaitou[5] = "";

mondai[6] = "鼻腔や気管支の表面にある繊毛や粘液は、付着した病原体を体外に排出する物理的バリアーとして働く。";
seitou[6] = 'm';
kaitou[6] = "";

mondai[7] = "胃液中の塩酸や汗の中のリゾチームは病原体に対する化学的バリアーとして働いている。";
seitou[7] = 'm';
kaitou[7] = "";

mondai[8] = "免疫複合体(抗原抗体複合体)は、補体を活性化する。";
seitou[8] = 'm';
kaitou[8] = "古典経路に関する記述である。";

mondai[9] = "補体の活性化には、免疫複合体が必須である。";
seitou[9] = 'b';
kaitou[9] = "レクチン経路や第二経路では関与しない。";

mondai[10] = "補体活性化により生じたC3bには、オプソニン化作用がある。";
seitou[10] = 'm';
kaitou[10] = "";

mondai[11] = "免疫反応とは、非自己を認識、排除して生体の恒常性の維持に働く機能である。";
seitou[11] = 'm';
kaitou[11] = "";

mondai[12] = "T細胞レセプターはMHC抗原の認識に関与する。";
seitou[12] = 'm';
kaitou[12] = "";

mondai[13] = "同じ病原体が再び生体内に侵入すると速やかに大量の抗体が産生される。";
seitou[13] = 'm';
kaitou[13] = "";

mondai[14] = "それぞれの抗原に対応する抗体分子のH鎖及びL鎖の遺伝子は、ヒト胚細胞のDNA上にひと続きの遺伝子としてコードされている。";
seitou[14] = 'b';
kaitou[14] = "抗体の遺伝子は可変部と定常部に分かれてコードされている。可変部の遺伝子は、遺伝子再構成により抗原特異性の多様性をもつことになるが、一方、定常部の遺伝子はクラススイッチにより5つのアイソタイプを与える。";

mondai[15] = "自己成分と反応するクローンは、一般に除去又は不活性化される。";
seitou[15] = 'm';
kaitou[15] = "";

mondai[16] = "ある抗原が生体内に侵入すると、その抗原に特異的な受容体をもつリンパ球のみが活性化され、増殖・文化する。";
seitou[16] = 'm';
kaitou[16] = "";

mondai[17] = "抗体が介在する免疫を体液性免疫といい、リンパ球が直接かかわる免疫を細胞性免疫という。";
seitou[17] = 'm';
kaitou[17] = "";

mondai[18] = "B細胞による抗体産生には、一般にヘルパーT細胞の補助を必要としない。";
seitou[18] = 'b';
kaitou[18] = "大部分の抗原で、B細胞による抗体産生にヘルパーT細胞の補助が必要である。";

mondai[19] = "ウイルス感染細胞や細胞内寄生菌の排除には、体液性免疫が有効である。";
seitou[19] = 'b';
kaitou[19] = "抗体は細胞膜を通過できないため、細胞内のウイルスや細胞内寄生菌に対しては無効である。細胞性免疫が有効である。";