var num_max = 13;
var mondai = [];
var seitou = [];
var kaitou = [];

mondai[1] = "グリセロリン脂質は両親媒性物質であり、細胞膜の構成成分である。";
seitou[1] = 'm';
kaitou[1] = "";

mondai[2] = "同じ炭素数の不飽和脂肪酸では、不飽和度が高いほど沸点が高い。";
seitou[2] = 'b';
kaitou[2] = "脂肪酸の融点は、炭素数が同じであれば不飽和度が高いほど低くなる。";

mondai[3] = "天然脂肪酸は、一般に炭素数が偶数個でアルキル鎖は直鎖状である。";
seitou[3] = 'm';
kaitou[3] = "";

mondai[4] = "天然脂肪酸の炭素-炭素二重結合はcis型(シス型)よりtrans型(トランス型)の方が多い。";
seitou[4] = 'b';
kaitou[4] = "天然脂肪酸の二重結合はほとんどcis型である。";

mondai[5] = "リノール酸は必須脂肪酸であり、ヒト体内で生合成できない。";
seitou[5] = 'm';
kaitou[5] = "ヒト体内で生合成できない脂肪酸には、ほかにα-リノレン酸がある。";

mondai[6] = "アラキドン酸は、エイコサノイドの原料となる脂肪酸である。";
seitou[6] = 'm';
kaitou[6] = "エイコサノイドとは、アラキドン酸などの炭素数20個からなる不飽和脂肪酸から合成される生理活性物質(例えばプロスタグランジン、ロイコトリエンなど)のことで、炎症などに関与している。";

mondai[7] = "脂肪酸はリン脂質の構成成分として、親水性物質の透過バリアーとして機能する。";
seitou[7] = 'm';
kaitou[7] = "";

mondai[8] = "ヒトにおいて脂肪酸は、アセチルCoAを原料として生合成される。";
seitou[8] = 'm';
kaitou[8] = "";

mondai[9] = "脂肪酸の生合成過程において、マロニルCoAはアセチルCoAの脱炭酸反応により生成される。";
seitou[9] = 'b';
kaitou[9] = "マロニルCoAはアセチルCoAの炭酸固定反応により生成される。";

mondai[10] = "不飽和脂肪酸は、動物体内では合成されない。";
seitou[10] = 'b';
kaitou[10] = "不飽和脂肪酸は、動物体内で飽和脂肪酸の不飽和化により生合成される。ただし、リノール酸とリノレン酸は合成できない。";

mondai[11] = "ヒトにおいて、コレステロールはおもに肝臓でマロニルCoAにより生合成される。";
seitou[11] = 'b';
kaitou[11] = "コレステロールは、おもに肝臓でアセチルCoAにより生合成される。";

mondai[12] = "コレステロールはシトクロムP450が関与する反応によって、胆汁酸やステロイドホルモンに代謝される。";
seitou[12] = 'm';
kaitou[12] = "";

mondai[13] = "コレステロール生合成の律速酵素は、ホスホリパーゼA<sub>2</sub>である。";
seitou[13] = 'b';
kaitou[13] = "コレステロール生合成の律速酵素は、HMG-CoA還元酵素(リダクターゼ)である。";