var num_max = 7;
var mondai = [];
var seitou = [];
var kaitou = [];

mondai[1] = "細胞接着分子は、細胞間を結びつける働きをする。";
seitou[1] = 'm';
kaitou[1] = "";

mondai[2] = "同種の細胞同士の結合は、一般的にカドヘリンのような細胞表面タンパク質を介して行われる。";
seitou[2] = 'm';
kaitou[2] = "";

mondai[3] = "CD8主要組織適合遺伝子複合体(MHC)のクラスI分子及びクラスII分子に結合する。";
seitou[3] = 'b';
kaitou[3] = "CD8は、MHCクラスI分子のみと結合する。MHCクラスII分子と結合するのはCD4である。";

mondai[4] = "I型コラーゲンは体内に最も豊富に存在するコラーゲンである";
seitou[4] = 'm';
kaitou[4] = "";

mondai[5] = "エラスチンは弾性線維の成分で、細胞外マトリックスに弾力を与える役割がある。";
seitou[5] = 'm';
kaitou[5] = "";

mondai[6] = "フィブロネクチンは、基底膜の主要構成成分である。";
seitou[6] = 'b';
kaitou[6] = "フィブロネクチンは細胞外マトリックス成分や細胞膜の接着分子と結合する接着性タンパク質である。";