var num_max = 10;
var mondai = [];
var seitou = [];
var kaitou = [];

mondai[1] = "プリンヌクレオチドは、その生合成過程において遊離塩基として合成されてから糖部分に結合する。";
seitou[1] = 'b';
kaitou[1] = "プリンヌクレオチドの生合成過程では、プリン環構造はPRPP(ホスホリボシルピロリン酸)の1'位にアミノ酸などを順次反応させて合成される。";

mondai[2] = "デオキシウリジル酸に、チミジル酸シンターゼが作用することでチミジル酸が生成する。";
seitou[2] = 'm';
kaitou[2] = "";

mondai[3] = "ヌクレオチドの分解により生じたプリンは、サルベージ経路により再利用されない。";
seitou[3] = 'b';
kaitou[3] = "ヌクレオチドの分解により遊離したプリン塩基の約90%がサルベージ経路により再利用される。";

mondai[4] = "DNAは、デオキシヌクレオチドを基本単位としてホスホジエステル結合で重合した化合物である。";
seitou[4] = 'm';
kaitou[4] = "";

mondai[5] = "DNAを構成する塩基は、アデニン、グアニン、シトシン及びチミンの4種類である。";
seitou[5] = 'm';
kaitou[5] = "";

mondai[6] = "DNA二重らせんは、互いに逆方向の2本のポリヌクレオチド鎖からなる。";
seitou[6] = 'm';
kaitou[6] = "2本のポリヌクレオチド鎖は、相補的な塩基間で水素結合を形成している。";

mondai[7] = "生理的条件下ではDNAはB型構造で、左巻きの二重らせん構造を形成している。";
seitou[7] = 'b';
kaitou[7] = "B型構造のDNAは右巻きであり、左巻きDNAはZ型と呼ばれている。";

mondai[8] = "RNAを構成する糖の2'位には水酸基が存在する。";
seitou[8] = 'm';
kaitou[8] = "";

mondai[9] = "多くのRNAは一本鎖であるが、分子内で部分的に塩基対を形成することがある。";
seitou[9] = 'm';
kaitou[9] = "";

mondai[10] = "真核生物の多くのmRNAはその3'末端にキャップ構造をもっている。";
seitou[10] = 'b';
kaitou[10] = "キャップ構造(7-メチルグアノシン)は、真核生物のmRNAの5'末端に存在する。";