var num_max = 6;
var mondai = [];
var seitou = [];
var kaitou = [];

mondai[1] = "グリシンは不斉炭素をもたないため光学的に不活性である。";
seitou[1] = 'm';
kaitou[1] = "";

mondai[2] = "チロシンの紫外部吸収スペクトルを測定すると、通常280nm付近に吸収極大を示す。";
seitou[2] = 'm';
kaitou[2] = "";

mondai[3] = "等電点とは、溶質分子全体として電荷が0になるときの溶媒のpHである。";
seitou[3] = 'm';
kaitou[3] = "";

mondai[4] = "アスパラギン酸はピルビン酸からアミノ基転移反応によって生成する。";
seitou[4] = 'b';
kaitou[4] = "アスパラギン酸はピルビン酸ではなく、オキサロ酢酸から生成する。";

mondai[5] = "尿素回路は腎臓に存在する。";
seitou[5] = 'b';
kaitou[5] = "尿素回路は<b>肝臓</b>に存在する。";

mondai[6] = "フェニルアラニンヒドロキシラーゼの活性低下によりフェニルケトン尿症になる。";
seitou[6] = 'm';
kaitou[6] = "";