var num_max = 6;
var mondai = [];
var seitou = [];
var kaitou = [];

mondai[1] = "窒素固定能をもつ細菌は、大気中の窒素を還元してアンモニアを生成する。";
seitou[1] = 'm';
kaitou[1] = "";

mondai[2] = "大腸菌は二酸化炭素からグルコースを合成し、デンプンとして貯蔵できる。";
seitou[2] = 'b';
kaitou[2] = "この反応は、植物でみられる光合成によるものである。大腸菌は光合成を行わない。";

mondai[3] = "クロストリジウム属の細菌は好気性の細菌である。";
seitou[3] = 'b';
kaitou[3] = "クロストリジウム属の細菌は、<b>嫌気性</b>の細菌である。";

mondai[4] = "細菌は真核生物であるが、真菌は原核生物である。";
seitou[4] = 'b';
kaitou[4] = "細菌は原核生物であり、真菌(かびや酵母)は真核生物である。";

mondai[5] = "原核細胞には、核膜がない。";
seitou[5] = 'm';
kaitou[5] = "";

mondai[6] = "真核細胞の細胞壁にはペプチドグリカンは含まれない。";
seitou[6] = 'm';
kaitou[6] = "";