var num_max = 16;
var mondai = [];
var seitou = [];
var kaitou = [];

mondai[1] = "上皮細胞増殖因子(EGF受容体)は、チロシンキナーゼ関連型受容体である。";
seitou[1] = 'm';
kaitou[1] = "";

mondai[2] = "アドレナリンβ受容体は、Gタンパク共役型受容体である。";
seitou[2] = 'm';
kaitou[2] = "";

mondai[3] = "Gqタンパク質は、3種類のサブユニットからなる三量体である。";
seitou[3] = 'm';
kaitou[3] = "";

mondai[4] = "イオンチャネル型受容体は、細胞膜受容体の1つである。";
seitou[4] = 'm';
kaitou[4] = "";

mondai[5] = "ヘモグロビンは酵素輸送タンパク質である。";
seitou[5] = 'm';
kaitou[5] = "";

mondai[6] = "セルロプラスミンは鉄の輸送を行なっている。";
seitou[6] = 'b';
kaitou[6] = "セルロプラスミンは<b>銅</b>の輸送を行なっている。";

mondai[7] = "フェリチンは鉄の輸送にかかわるタンパク質である。";
seitou[7] = 'b';
kaitou[7] = "鉄の輸送にかかわるタンパク質はトランスフェリンである。";

mondai[8] = "一般に、血漿リポタンパク質中のコレステロールは、大半が脂肪酸エステル型となっている。";
seitou[8] = 'm';
kaitou[8] = "";

mondai[9] = "キロミクロンは、小腸で合成されるリポタンパク質である。";
seitou[9] = 'm';
kaitou[9] = "";

mondai[10] = "キロミクロンは、門脈に入り肝臓に輸送される。";
seitou[10] = 'b';
kaitou[10] = "キロミクロンは、門脈に入らずリンパ管に入る。";

mondai[11] = "Rasは、低分子量Gタンパク質の一種である。";
seitou[11] = 'm';
kaitou[11] = "";

mondai[12] = "MAPキナーゼは、セリン/トレオニンキナーゼの一種である。";
seitou[12] = 'm';
kaitou[12] = "";

mondai[13] = "サイクリン依存性キナーゼは、細胞周期の段階移行にかかわる酵素である。";
seitou[13] = 'm';
kaitou[13] = "";

mondai[14] = "中間径フィラメントは、有糸分裂の際に染色体の移動に働く。";
seitou[14] = 'b';
kaitou[14] = "染色体の移動に働くのは微小管である。";

mondai[15] = "微小管は、細胞内の物質の移動に関与する。";
seitou[15] = 'm';
kaitou[15] = "";

mondai[16] = "アクチンフィラメントは、筋肉の収縮にも関与する。";
seitou[16] = 'm';
kaitou[16] = "";