var num_max = 4;
var mondai = [];
var seitou = [];
var kaitou = [];

mondai[1] = "ラジオイムノアッセイでは放射性同位元素、酵素、蛍光物質などで標識した抗原又は抗体を用いて抗原抗体反応物の量を測定する。";
seitou[1] = 'b';
kaitou[1] = "ラジオイムノアッセイでは放射性同位元素で標識した抗原や抗体を用いる。";

mondai[2] = "イムノアッセイによるホルモンの定量では測定値と生理活性が常に相関する。";
seitou[2] = 'b';
kaitou[2] = "測定値の大小は生理活性の大小と必ずしも一致しない。";

mondai[3] = "ハプテンとは通常低分子量の物質で、単独では免疫原性をもつが抗原性をもたない物質をいう。";
seitou[3] = 'b';
kaitou[3] = "ハプテンは単独で抗原性(抗原と結合する能力)をもつが免疫原性(抗体を産生させる能力)はもたない。ハプテンはタンパク質などの高分子と結合した場合には免疫原性を示す。";

mondai[4] = "ELISA(enzyme-linked immunosorbent assay)では抗原又は抗体を固相とし、酵素で標識した抗体又は抗原を反応させる。";
seitou[4] = 'm';
kaitou[4] = "";