var num_max = 12;
var mondai = [];
var seitou = [];
var kaitou = [];

mondai[1] = "ATPは、cAMPからアデニル酸シクラーゼにより生成される。";
seitou[1] = 'b';
kaitou[1] = "cAMPは、アデニル酸シクラーゼによりATPから生成される。";

mondai[2] = "細胞内のcGMPが上昇すると、Gキナーゼの活性化がおこる。";
seitou[2] = 'm';
kaitou[2] = "";

mondai[3] = "イノシトール1,4,5-三リン酸(IP<sub>3</sub>)は、筋小胞体からのカルシウムの放出を促す。";
seitou[3] = 'm';
kaitou[3] = "";

mondai[4] = "アドレナリンα<sub>1</sub>受容体は1回膜貫通型の受容体である。";
seitou[4] = 'b';
kaitou[4] = "7回膜貫通型の受容体である。";

mondai[5] = "アドレナリンβ受容体はGsタンパク質共役型の受容体であり、アデニル酸シクラーゼを活性化する。";
seitou[5] = 'm';
kaitou[5] = "";

mondai[6] = "三量体Gタンパク質は、不活性な状態では、そのαサブユニット上にGTPが結合している。";
seitou[6] = 'b';
kaitou[6] = "不活性型では、GDPが結合している。";

mondai[7] = "ムスカリンM<sub>2</sub>受容体作動薬はホスファチジルイノシトール(PI)代謝回転を介して細胞内Ca<sub>2</sub>を上昇させる。";
seitou[7] = 'b';
kaitou[7] = "ホスファチジルイノシトール代謝回転を介するのは、M<sub>1</sub>受容体、M<sub>3</sub>受容体などである。";

mondai[8] = "上皮増殖因子受容体は、チロシンキナーゼ関連型受容体である。";
seitou[8] = 'm';
kaitou[8] = "";

mondai[9] = "MAPキナーゼは、熱ショックや紫外線などにより活性化されることがある。";
seitou[9] = 'm';
kaitou[9] = "";

mondai[10] = "ヒドロコルチゾンは、細胞質受容体と結合し、核へ移行後DNAと結合する。";
seitou[10] = 'm';
kaitou[10] = "";

mondai[11] = "活性型ビタミンD<sub>3</sub>は受容体を介さず直接DNAへ作用する。";
seitou[11] = 'b';
kaitou[11] = "活性型ビタミンD<sub>3</sub>は、核内受容体と結合する。";

mondai[12] = "バソプレシンは、核内受容体と結合することにより抗利尿作用を示す。";
seitou[12] = 'b';
kaitou[12] = "バソプレシンはペプチドホルモンであり、細胞膜受容体に作用する。";