var num_max = 12;
var mondai = [];
var seitou = [];
var kaitou = [];

mondai[1] = "ニューロンは細胞体、樹状突起、軸索からなる。";
seitou[1] = 'm';
kaitou[1] = "";

mondai[2] = "静止膜電位とは、細胞に刺激を与えないときの膜電位である。";
seitou[2] = 'm';
kaitou[2] = "";

mondai[3] = "神経軸索状の一点を刺激すると、興奮伝導は刺激点より片側のみに伝わる。";
seitou[3] = 'b';
kaitou[3] = "興奮伝導は両側に伝わる(両方向性伝導)。";

mondai[4] = "シナプスにおける細胞間の情報の受け渡しを伝導とよぶ。";
seitou[4] = 'b';
kaitou[4] = "シナプスにおける情報の受け渡しを伝達とよぶ。";

mondai[5] = "ホメオスタシスとは外部環境の恒常性をいう。";
seitou[5] = 'b';
kaitou[5] = "体内環境(内部環境)の恒常性をいう。";

mondai[6] = "ホメオスタシスの調節には、一般に負のフィードバックがかかわっている。";
seitou[6] = 'm';
kaitou[6] = "";

mondai[7] = "運動神経終末からは、アセチルコリンが遊離する。";
seitou[7] = 'm';
kaitou[7] = "";

mondai[8] = "洞房結節は、ペースメーカーとして働く。";
seitou[8] = 'm';
kaitou[8] = "";

mondai[9] = "平滑筋は、横紋構造を有する。";
seitou[9] = 'b';
kaitou[9] = "平滑筋はアクチンフィラメントとミオシンフィラメントが不規則的に配列されているため、横紋構造はない。";

mondai[10] = "ミオシン頭部には、ATPaseが存在する。";
seitou[10] = 'm';
kaitou[10] = "";

mondai[11] = "リアノジン受容体を介して筋小胞体からCa<sup>2+</sup>の遊離がおこる。";
seitou[11] = 'm';
kaitou[11] = "";

mondai[12] = "平滑筋は随意筋である。";
seitou[12] = 'b';
kaitou[12] = "平滑筋は不随意筋である。";