var num_max = 10;
var mondai = [];
var seitou = [];
var kaitou = [];

mondai[1] = "心臓の刺激伝導系は、特殊な神経細胞で構成されている。";
seitou[1] = 'b';
kaitou[1] = "刺激伝導系は、神経ではなく特殊心筋で構成されている。";

mondai[2] = "三尖弁は右心房から右心室へ流れる血液の逆流を防ぐ。";
seitou[2] = 'm';
kaitou[2] = "";

mondai[3] = "冠状動脈は肺動脈から分岐する。";
seitou[3] = 'b';
kaitou[3] = "冠状動脈は大動脈起始部から枝分かれしている。";

mondai[4] = "冠状動脈は心筋細胞への酸素や栄養分の供給に関与する。";
seitou[4] = 'm';
kaitou[4] = "";

mondai[5] = "洞房結節の活動電位の立ち上がりは、Na<sup>+</sup>の流入により形成される。";
seitou[5] = 'b';
kaitou[5] = "洞房結節の活動電位の立ち上がりは、<b>Ca<sup>2+</sup></b>の流入により形成される。";

mondai[6] = "動脈は、容量血管として機能する血管である。";
seitou[6] = 'b';
kaitou[6] = "容量血管としての性質があるのは静脈である。";

mondai[7] = "全身の動脈と静脈には、いずれも逆流を防ぐための弁がある。";
seitou[7] = 'b';
kaitou[7] = "弁があるのは静脈系のみである。";

mondai[8] = "動脈は内皮細胞のみで構成される。";
seitou[8] = 'b';
kaitou[8] = "動脈は、内膜・中膜・外膜の3層よりなる。";

mondai[9] = "リンパ管には、弁がある。";
seitou[9] = 'm';
kaitou[9] = "";

mondai[10] = "リンパ節は、侵入した異物に対する防御機構の役割を果たしている。";
seitou[10] = 'm';
kaitou[10] = "";