var num_max = 4;
var mondai = [];
var seitou = [];
var kaitou = [];

mondai[1] = "人口中0.1%以上の頻度で存在する遺伝子の変異を多型とよぶ。";
seitou[1] = 'b';
kaitou[1] = "人口中<b>1%以上</b>の頻度で存在する変異をもつ場合を多型といい、それ以下の場合は突然変異として扱う。";

mondai[2] = "遺伝子多型を疾患の原因遺伝子のクローニングに利用することができる。";
seitou[2] = 'm';
kaitou[2] = "";

mondai[3] = "一塩基多型(SNP)は、2~4塩基単位の配列の繰り返しである。";
seitou[3] = 'b';
kaitou[3] = "1つの塩基が他の塩基に置き換わっているものである。";

mondai[4] = "薬の利き方の個人差と遺伝子多型は関係しない。";
seitou[4] = 'b';
kaitou[4] = "薬物の代謝酵素や輸送タンパク質の遺伝子多型が薬の有効性や副作用と密接に関係する。";