var num_max = 4;
var mondai = [];
var seitou = [];
var kaitou = [];

mondai[1] = "感染源が病院外である場合には、病院内で発病しても院内感染症ではない。";
seitou[1] = 'm';
kaitou[1] = "";

mondai[2] = "メチシリン耐性黄色ブドウ球菌(MRSA)の感染は、主に飛沫感染による。";
seitou[2] = 'b';
kaitou[2] = "主に接触感染であるため、手洗いなどを十分に行い、ケアに際しては手袋の着用など物理的バリアーを使用する。";

mondai[3] = "感染対策委員会は、病院長、各科の診療科長からなる委員会であり、薬剤師は含まれない。";
seitou[3] = 'b';
kaitou[3] = "病院長もしくは副院長、看護部長、各科の診療科長、検査部長、薬剤部長及び事務長など管理責任をもつ人材と、感染制御医、感染制御看護師及び感染制御薬剤師からなる。";

mondai[4] = "結核菌には、紫外線による殺菌処理が有効である。";
seitou[4] = 'm';
kaitou[4] = "";