var num_max = 10;
var mondai = [];
var seitou = [];
var kaitou = [];

mondai[1] = "大脳半球は、前頭葉、頭頂葉、側頭葉、後頭葉の4つの領域に分けられる。";
seitou[1] = 'm';
kaitou[1] = "";

mondai[2] = "脳幹には、中脳、橋、延髄及び小脳が含まれる。";
seitou[2] = 'b';
kaitou[2] = "小脳は脳幹には含まれない。";

mondai[3] = "脳神経と脊髄反射は、中枢神経系である。";
seitou[3] = 'b';
kaitou[3] = "中枢神経系を構成するのは、脳と脊髄である。脳神経と脊髄神経は末梢神経系を構成する。";

mondai[4] = "大脳基底核は、尾状核、被殻、淡蒼球から構成される。";
seitou[4] = 'm';
kaitou[4] = "";

mondai[5] = "体性神経系は運動神経と自律神経からなる。";
seitou[5] = 'b';
kaitou[5] = "体性神経系は運動神経と感覚(知覚)神経からなる。";

mondai[6] = "知覚神経は遠心性線維で構成される。";
seitou[6] = 'b';
kaitou[6] = "知覚神経は求心性線維で構成される。";

mondai[7] = "屈曲反射は、運動神経を介した脊髄反射の一種である。";
seitou[7] = 'm';
kaitou[7] = "";

mondai[8] = "副交感神経が興奮すると、気管支平滑筋は収縮する。";
seitou[8] = 'm';
kaitou[8] = "";

mondai[9] = "多くの器官は交感神経と副交感神経の二重支配を受けている。";
seitou[9] = 'm';
kaitou[9] = "二重支配により、主に拮抗的に作用している。";

mondai[10] = "迷走神経には副交感神経が含まれる。";
seitou[10] = 'm';
kaitou[10] = "";