var num_max = 13;
var mondai = [];
var seitou = [];
var kaitou = [];

mondai[1] = "モノアミンとは、その構造中にアミノ基(-NH<sub>2</sub>)を1つ有する生体アミンの総称である。";
seitou[1] = 'm';
kaitou[1] = "";

mondai[2] = "生合成されたカテコールアミンは、貯蔵されることなく、直後に放出される。";
seitou[2] = 'b';
kaitou[2] = "細胞内の貯蔵部位に蓄えられ、刺激に応じて放出される。";

mondai[3] = "ドパミンは、カテコール-O-メチルトランスフェラーゼ(COMT)により分解される。";
seitou[3] = 'm';
kaitou[3] = "";

mondai[4] = "カテコールアミンは、モノアミンオキシダーゼ(MAO)によって酸化的脱アミノ化される。";
seitou[4] = 'm';
kaitou[4] = "";

mondai[5] = "セロトニンの多くは、腸粘膜クロム親和性細胞で生合成される。";
seitou[5] = 'm';
kaitou[5] = "";

mondai[6] = "セロトニンはチロシンから生合成される。";
seitou[6] = 'b';
kaitou[6] = "セロトニンは、トリプトファンから生合成される。";

mondai[7] = "γ-アミノ酪酸(GABA)は、GABA<sub>A</sub>受容体に内蔵するCl<sup>-</sup>チャネルを開口させる。";
seitou[7] = 'm';
kaitou[7] = "";

mondai[8] = "グリシンは抑制性神経伝達物質として働く。";
seitou[8] = 'm';
kaitou[8] = "";

mondai[9] = "アンギオテンシンIIは血管拡張作用を有する。";
seitou[9] = 'b';
kaitou[9] = "アンギオテンシンIIは、血管平滑筋収縮作用を有する。";

mondai[10] = "ペプチド系神経伝達物質の遊離には、持続的な細胞内Ca<sup>2+</sup>の上昇が必要である。";
seitou[10] = 'm';
kaitou[10] = "";

mondai[11] = "アセチルコリンは、末梢神経にのみ存在する。";
seitou[11] = 'b';
kaitou[11] = "大脳皮質や海馬、線条体などの中枢神経系にも存在する。";

mondai[12] = "アセチルコリン受容体は、ニコチン性アセチルコリン受容体とムスカリン性アセチルコリン受容体に大別される。";
seitou[12] = 'm';
kaitou[12] = "";

mondai[13] = "神経終末からのアセチルコリンの遊離には、細胞内Ca<sup>2+</sup>濃度の上昇が必要である。";
seitou[13] = 'm';
kaitou[13] = "";