var num_max = 5;
var mondai = [];
var seitou = [];
var kaitou = [];

mondai[1] = "X線結晶解析法では、未知化合物の立体構造を一義的に決定できる。";
seitou[1] = 'm';
kaitou[1] = "核酸やタンパク質などの高分子化合物の構造も決定可能である。";

mondai[2] = "X線結晶解析法では、物質に連続X線を照射し、その反射パターンを測定する。";
seitou[2] = 'b';
kaitou[2] = "固有X線(特性X線)を用いる。";

mondai[3] = "X線の波長を正確に制御できるシンクロトロン放射光を用いた測定法もある。";
seitou[3] = 'm';
kaitou[3] = "";

mondai[4] = "連続X線の波長は、X線管球の対陰極元素により決定する。";
seitou[4] = 'b';
kaitou[4] = "波長が対陰極により決定されるのは特性X線である。";

mondai[5] = "X線結晶解析法は、X線の回折現象を利用している。";
seitou[5] = 'm';
kaitou[5] = "";
