var num_max = 5;
var mondai = [];
var seitou = [];
var kaitou = [];

mondai[1] = "医師が健康状態を診断するために行う分析を臨床分析という。";
seitou[1] = 'm';
kaitou[1] = "";

mondai[2] = "精度管理に必要な分析の真度とは、繰り返し測定したときの測定値のバラつくの程度をいう。";
seitou[2] = 'b';
kaitou[2] = "真度とは測定値の平均値と真の値とのズレの程度である。";

mondai[3] = "信頼できる分析値を得るためにはトレーサビリティーの照明が重要である。";
seitou[3] = 'm';
kaitou[3] = "";

mondai[4] = "分析のトレーサビリティーの証明には、(認証)標準物質を用いなければならない。";
seitou[4] = 'm';
kaitou[4] = "";

mondai[5] = "精度管理に用いる認証標準物質には特性値のみが付されている。";
seitou[5] = 'b';
kaitou[5] = "認証標準物質には特性値のほか、標準物質認証書と認証値の不確かさが付いている。";
