var num_max = 10;
var mondai = [];
var seitou = [];
var kaitou = [];

mondai[1] = "アルブミンは、球状タンパク質である。";
seitou[1] = 'm';
kaitou[1] = "";

mondai[2] = "ヒストンは、DNAに結合している酸性タンパク質である。";
seitou[2] = 'b';
kaitou[2] = "ヒストンは、塩基性タンパク質である。";

mondai[3] = "筋肉タンパク質にはケラチンがある。";
seitou[3] = 'b';
kaitou[3] = "筋肉タンパク質にはアクチンとミオシンがある。";

mondai[4] = "コラーゲンは、体内にもっとも多く存在するタンパク質である。";
seitou[4] = 'm';
kaitou[4] = "";

mondai[5] = "タンパク質の二次構造は、ペプチド結合間での水素結合により形成される。";
seitou[5] = 'm';
kaitou[5] = "";

mondai[6] = "αヘリックスやβシートは、タンパク質の二次構造の形成に関与している。";
seitou[6] = 'm';
kaitou[6] = "";

mondai[7] = "球状タンパク質の親水性アミノ酸残基は、タンパク質の表面に存在する割合が高い。";
seitou[7] = 'm';
kaitou[7] = "";

mondai[8] = "糖鎖が付加するのはタンパク質中のチロシン残基、セリン残基、トレオニン残基である。";
seitou[8] = 'b';
kaitou[8] = "アスパラギン残基、セリン残基、トレオニン残基である。";

mondai[9] = "リン酸基が付加するのは、タンパク質のアスパラギン残基、セリン残基、トレオニン残基である。";
seitou[9] = 'b';
kaitou[9] = "チロシン残基、セリン残基、トレオニン残基である。";

mondai[10] = "タンパク質のN-ミリストイル化はリジン残基におこる。";
seitou[10] = 'b';
kaitou[10] = "N末端グリシンにおこる。";