var num_max = 18;
var mondai = [];
var seitou = [];
var kaitou = [];

mondai[1] = "分析法のバリデーションとは、医薬品の試験に用いる分析法の妥当性を検証することである。";
seitou[1] = 'm';
kaitou[1] = "";

mondai[2] = "分析の真度とは、得られた測定値の真の値との偏りの程度のを示すパラメーターである。";
seitou[2] = 'm';
kaitou[2] = "";

mondai[3] = "同じ検体から採取した複数の試料を分析した一連の測定値の一致の程度を示すパラメーターを精度という。";
seitou[3] = 'm';
kaitou[3] = "";

mondai[4] = "精度は測定値の総平均と真の値との差(残差)により表される。";
seitou[4] = 'b';
kaitou[4] = "精度ではなく、真度である。精度は測定値の分散、標準偏差または相対標準偏差であらわされる。";

mondai[5] = "検出限界は定量限界ともいわれる。";
seitou[5] = 'b';
kaitou[5] = "検出限界とは検出できる最小量であり、定量可能な最小量である定量限界とは異なる。";

mondai[6] = "ある物質について乾燥や加熱などを行った際、前後の質量に差を認めなくなったときの質量を恒量という。";
seitou[6] = 'm';
kaitou[6] = "";

mondai[7] = "日本薬局方では、引き続きさらに1時間乾燥または強熱するとき、前後の秤量差が前回量った乾燥物または強熱した残留物の質量の1.0%以下となった場合を恒量とする。";
seitou[7] = 'b';
kaitou[7] = "1.0%ではなく、0.10%である。";

mondai[8] = "日本薬局方の強熱残分試験法は揮発重量法に分類できる。";
seitou[8] = 'm';
kaitou[8] = "";

mondai[9] = "日本薬局方医薬品「注射用フェニトインナトリウム」では沈殿による重量分析法が適用されている。";
seitou[9] = 'b';
kaitou[9] = "溶媒溶出による重量分析法が適用されている。";

mondai[10] = "乾燥減量試験法は、乾燥によって失われる試料中の水分、結晶水などの量を測定するために用いられる。";
seitou[10] = 'm';
kaitou[10] = "";

mondai[11] = "容量分析用標準液の規定された濃度からのズレの度合いをファクターという。";
seitou[11] = 'm';
kaitou[11] = "";

mondai[12] = "ある標準液1mLと反応する目的物質の理論量(mg)を対応量という。";
seitou[12] = 'm';
kaitou[12] = "";

mondai[13] = "酢酸溶媒中過塩素酸標準液による滴定は、酸化還元反応を利用している。";
seitou[13] = 'b';
kaitou[13] = "酸化還元反応ではなく、酸塩基反応を利用している。";

mondai[14] = "沈殿滴定において吸着指示薬を用いて硝酸銀標準液で滴定する方法をモール(Mohr)法という。";
seitou[14] = 'b';
kaitou[14] = "モール法ではなく、ファヤンス(Fajans)法である。";

mondai[15] = "酸化還元反応において、終点検出に用いられる電位差滴定法での指示電極には白金電極が適している。";
seitou[15] = 'm';
kaitou[15] = "";

mondai[16] = "モルモンなどの生物活性物質を生物学的反応を用いて定量する方法をバイオアッセイという。";
seitou[16] = 'm';
kaitou[16] = "";

mondai[17] = "生物学的定量法とは、試験に生き物を使うため、結果が個体差や年齢などの要因に影響されやすい。";
seitou[17] = 'm';
kaitou[17] = "そのため、統計学的な検証を必要とする。";

mondai[18] = "バイオアッセイの結果は医薬品の単位体積または質量当たりの活性量で表される。";
seitou[18] = 'm';
kaitou[18] = "";
