var num_max = 10;
var mondai = [];
var seitou = [];
var kaitou = [];

mondai[1] = "酸素の基質特異性と反応は、全て「鍵と鍵穴モデル」で説明できる。";
seitou[1] = 'b';
kaitou[1] = "ほかに「誘導適合モデル」もある。";

mondai[2] = "「鍵と鍵穴モデル」の具体例としてニワトリ卵白リゾチームが挙げられる。";
seitou[2] = 'm';
kaitou[2] = "";

mondai[3] = "酵素反応の「鍵と鍵穴モデル」では、酵素は大きく立体構造を変化させる。";
seitou[3] = 'b';
kaitou[3] = "「誘導適合モデル」の記述である。";

mondai[4] = "酵素が基質と結合すると、酵素自身が酵素活性をおこしやすいように変化することを「誘導適合モデル」という。";
seitou[4] = 'm';
kaitou[4] = "";

mondai[5] = "DNAと酵素タンパク質が相互作用する場合、DNAはまったく構造変化しない。";
seitou[5] = 'b';
kaitou[5] = "DNAは、しばしば酵素と結合し、大きく構造を変化させている。";

mondai[6] = "液体中に非極性物質が存在すると、水分子はその周りに水の殻を形成する。";
seitou[6] = 'm';
kaitou[6] = "これを疎水性水和とよぶ。";

mondai[7] = "水中において、両親媒性の脂質の親水性部分は、水和するような集合体を形成する。";
seitou[7] = 'm';
kaitou[7] = "";

mondai[8] = "胆汁酸は水中でミセルを形成する。";
seitou[8] = 'm';
kaitou[8] = "胆汁酸や界面活性剤、リゾリン脂質などは水中でミセルを形成する。";

mondai[9] = "リン脂質であるレシチンは、水中で脂質二重層を形成する。";
seitou[9] = 'm';
kaitou[9] = "";

mondai[10] = "膜貫通タンパク質の膜貫通領域はほとんどがβシート構造をしている。";
seitou[10] = 'b';
kaitou[10] = "βシート構造ではなく、αヘリックス構造である。";
