var num_max = 20;
var mondai = [];
var seitou = [];
var kaitou = [];

mondai[1] = "タンパク質はアミノ酸がペプチド結合により連結したポリペプチド鎖からなる。";
seitou[1] = 'm';
kaitou[1] = "";

mondai[2] = "ポリペプチド鎖のアミノ酸配列順序をタンパク質の一次構造と呼ぶ。";
seitou[2] = 'm';
kaitou[2] = "";

mondai[3] = "タンパク質の二次構造で見られるαヘリックスとβシートは、主に水素結合で維持されている。";
seitou[3] = 'm';
kaitou[3] = "";

mondai[4] = "タンパク質の立体構造は、一般に一次構造による影響を受ける。";
seitou[4] = 'm';
kaitou[4] = "";

mondai[5] = "脂質二重層において、脂質分子は二重奏中を水平方向および垂直方向に容易に移動できる。";
seitou[5] = 'b';
kaitou[5] = "垂直方向に移動するフリップ-フロップ(Flip-Flop)現象は、おこりにくい。";

mondai[6] = "静電相互作用のポテンシャルエネルギーは、クーロン(Coulomb)の法則に従う。";
seitou[6] = 'm';
kaitou[6] = "";

mondai[7] = "静電相互作用の強さは、溶媒中の塩濃度に依存しない。";
seitou[7] = 'b';
kaitou[7] = "高塩基濃度条件下においては、対イオンにより電荷が中和されるため静電相互作用は弱まる。";

mondai[8] = "遠距離間のイオン-双極子相互作用および双極子-双極子相互作用は、タンパク質の立体構造の安定化に強く寄与する。";
seitou[8] = 'b';
kaitou[8] = "静電相互作用は距離の2乗ないし3乗に反比例するので、立体構造の安定化にあまり寄与しない。";

mondai[9] = "電荷をもたない原子同士でも、電子の揺らぎにより瞬間的な双極子を形成し、分散相互作用を生じる。";
seitou[9] = 'm';
kaitou[9] = "";

mondai[10] = "水素結合は大変強い結合で、いったん結合が生じると切断されることはほとんどない。";
seitou[10] = 'b';
kaitou[10] = "１本の水土結合はわずか10~50kl/molにすぎない。";

mondai[11] = "核酸はアミノ酸がペプチド結合で連結したものである。";
seitou[11] = 'b';
kaitou[11] = "核酸ではなく、タンパク質の説明である。";

mondai[12] = "核酸の安定性は、主として塩基間の水素結合と塩基面のスタッキングの2つの相互作用に基づいている。";
seitou[12] = 'm';
kaitou[12] = "";

mondai[13] = "DNA中のアデニンとチミン、グアニンとシトシンの塩基ついにおいて、その安定性に差はない。";
seitou[13] = 'b';
kaitou[13] = "A-T間は水素結合2本、G-C間は3本で、G-C間の方が安定である。";

mondai[14] = "核酸のホスホジエステル基は負電荷をもつので、塩基性タンパク質であるヒストンと結合する。";
seitou[14] = 'm';
kaitou[14] = "";

mondai[15] = "DNAの二重らせん構造は、加熱により塩基間の水素結合が切れて一本鎖となる。";
seitou[15] = 'm';
kaitou[15] = "";

mondai[16] = "リン脂質は、両親媒性構造を有する。";
seitou[16] = 'm';
kaitou[16] = "";

mondai[17] = "タンパク質のαヘリックスは、膜貫通タンパク質の安定化に関与している。";
seitou[17] = 'm';
kaitou[17] = "";

mondai[18] = "細胞膜の脂質二重層の組成は、一般に対称である。";
seitou[18] = 'b';
kaitou[18] = "一般に非対称である。";

mondai[19] = "細胞膜の細胞質側には細胞骨格が存在している。";
seitou[19] = 'm';
kaitou[19] = "";

mondai[20] = "細胞膜に含まれる糖脂質や等タンパク質は、主に脂質二重膜の外層に存在している。";
seitou[20] = 'm';
kaitou[20] = "";
