var num_max = 5;
var mondai = [];
var seitou = [];
var kaitou = [];

mondai[1] = "質量分析法は、原子又は分子をそのままの形で、質量数ごとに分離・検出する方法である。";
seitou[1] = 'b';
kaitou[1] = "原子や分子をイオンしたのち、質量と電荷の比に応じて分離・検出する。";

mondai[2] = "電子イオン化法は気化した試料に熱電子流を照射することでイオン化する方法である。";
seitou[2] = 'm';
kaitou[2] = "";

mondai[3] = "電子イオン化法では、種々のフラグメントイオンが生じる。";
seitou[3] = 'm';
kaitou[3] = "";

mondai[4] = "質量スペクトルにおいて強度の最も大きなピークを分子イオンピークという。";
seitou[4] = 'b';
kaitou[4] = "強度の最も大きなピークを基準ピークという。分子イオンピークは分子イオンに相当するピークである。";

mondai[5] = "高分解能質量分析計を用いれば元素組成式も判明する。";
seitou[5] = 'm';
kaitou[5] = "";
