var num_max = 20;
var mondai = [];
var seitou = [];
var kaitou = [];

mondai[1] = "DNAからRNAを合成する反応を翻訳とよぶ。";
seitou[1] = 'b';
kaitou[1] = "DNAからRNAを合成する反応は<b>転写</b>とよぶ。";

mondai[2] = "DNAを構成する糖は、D-リボースである。";
seitou[2] = 'b';
kaitou[2] = "DNAを構成する糖は、D-デオキシリボースである。";

mondai[3] = "生体内のRNAは、通常二本鎖で存在する。";
seitou[3] = 'b';
kaitou[3] = "生体内のRNAは、通常<b>一本鎖</b>で存在する。";

mondai[4] = "ゲノムとは、生物が生存するのに必要な全遺伝子を含むDNA全体をさす。";
seitou[4] = 'm';
kaitou[4] = "";

mondai[5] = "ヒトゲノムには、遺伝情報をもたない配列も含まれている。";
seitou[5] = 'm';
kaitou[5] = "";

mondai[6] = "ゲノム上を転移するDNAをトランスポゾンという。";
seitou[6] = 'm';
kaitou[6] = "";

mondai[7] = "真核生物の染色体の末端は、セントロメアとよばれている。";
seitou[7] = 'b';
kaitou[7] = "染色体の末端は、テロメアとよばれる。";

mondai[8] = "ユークロマチンは、凝集したクロマチン領域のことである。";
seitou[8] = 'b';
kaitou[8] = "ユークロマチンは、<b>分散</b>したクロマチン領域である。凝集したクロマチン領域はヘテロクロマチンとよばれる。";

mondai[9] = "ヌクレオソーム中のヒストンは、酸性タンパク質である。";
seitou[9] = 'b';
kaitou[9] = "ヒストンは、リジンやアルギニンを多く含む塩基性タンパク質である。";

mondai[10] = "ヌクレオソームは主にヒストンとDNAで構成される。";
seitou[10] = 'm';
kaitou[10] = "";

mondai[11] = "ヒストンH1は、コアヒストンを構成するヒストンである。";
seitou[11] = 'b';
kaitou[11] = "5種類(H1,H2A,H2B,H3,H4)のヒストン分子種のうち、ヒストンH1はリンカー部分に結合する。";

mondai[12] = "有糸分裂時、染色体のテロメア部分に紡錘糸が結合する。";
seitou[12] = 'b';
kaitou[12] = "紡錘糸はセントロメアに結合する。";

mondai[13] = "プロモーターは、転写開始に関与する配列である。";
seitou[13] = 'm';
kaitou[13] = "";

mondai[14] = "エンハンサーは、転写促進に関与する配列である。";
seitou[14] = 'm';
kaitou[14] = "";

mondai[15] = "TATAボックスは真核生物のプロモーターの一種である。";
seitou[15] = 'm';
kaitou[15] = "";

mondai[16] = "イントロンは、スプライシングにより除去される。";
seitou[16] = 'm';
kaitou[16] = "";

mondai[17] = "エキソンは、遺伝情報をもたない塩基配列である。";
seitou[17] = 'b';
kaitou[17] = "遺伝子領域で遺伝情報を含む部分をエキソン、含まない部分をイントロンという。";

mondai[18] = "原核生物のmRNAの5'末端付近にはシャイン-ダルガーノ(SD)配列とよばれるリボソーム結合部位が存在する。";
seitou[18] = 'm';
kaitou[18] = "";

mondai[19] = "tRNAはタンパク質合成の鋳型となる。";
seitou[19] = 'b';
kaitou[19] = "タンパク質合成の鋳型となるのはmRNAである。";

mondai[20] = "rRNAはリボソームの構成成分である。";
seitou[20] = 'm';
kaitou[20] = "";