var num_max = 10;
var mondai = [];
var seitou = [];
var kaitou = [];

mondai[1] = "細胞障害性T細胞(キラーT細胞)は、MHCクラスI抗原を認識し、標的細胞を障害する。";
seitou[1] = 'm';
kaitou[1] = "";

mondai[2] = "移植片拒絶反応はCD8<sup>+</sup>T細胞によるものであり、CD4<sup>+</sup>T細胞は関与しない。";
seitou[2] = 'b';
kaitou[2] = "移植片拒絶反応は主にキラーT細胞(CD8<sup>+</sup>T細胞)の細胞障害作用であるが、キラーT細胞が活性化されるのにヘルパーT細胞(CD4<sup>+</sup>T細胞)が必要である。";

mondai[3] = "ドナーのリンパ球がレシピエント(宿主)の組織細胞を攻撃することはない。";
seitou[3] = 'b';
kaitou[3] = "ドナーの移植片に含まれていたリンパ球が、免疫力の低下しているレシピエント(宿主)を攻撃することを、移植対宿主絶反応(GVHR: graft-versus-host reaction)という。";

mondai[4] = "副腎皮質ステロイド性薬はサイトカインの産生を抑制してリンパ球の機能を抑制する。";
seitou[4] = 'm';
kaitou[4] = "";

mondai[5] = "活性化補体成分にはオプソニン化作用を有するものがある。";
seitou[5] = 'm';
kaitou[5] = "";

mondai[6] = "ヒト免疫不全ウイルス(HIV)は、CD4<sup>+</sup>分子及びケモカインの受容体をもつ細胞に感染して破壊し、二次的に免疫不全を引きおこす。";
seitou[6] = 'm';
kaitou[6] = "";

mondai[7] = "粘膜上に分泌されて存在するIgAは、細菌やウイルスの生体内への侵入を阻止する。";
seitou[7] = 'm';
kaitou[7] = "";

mondai[8] = "免疫機構に欠陥のあるヒトの腫瘍発生頻度は、一般に正常なヒトと比較して高くなる。";
seitou[8] = 'm';
kaitou[8] = "";

mondai[9] = "癌関連抗原は、正常細胞には存在せず、癌細胞に特有である。";
seitou[9] = 'b';
kaitou[9] = "癌関連抗原は、一部の正常細胞にも発現している。癌特異抗原は、癌細胞に特有である。";

mondai[10] = "抗体と結合した腫瘍細胞はナチュラルキラー細胞(NK細胞)による抗体依存性細胞性細胞傷害反応(ADCC)で破壊される。";
seitou[10] = 'm';
kaitou[10] = "";