var num_max = 29;
var mondai = [];
var seitou = [];
var kaitou = [];

mondai[1] = "弱酸を強塩基で滴定したときの終点は酸性側となる。";
seitou[1] = 'b';
kaitou[1] = "塩基性側となる";

mondai[2] = "当量点付近におけるpHの急激な変化をpH飛躍という。";
seitou[2] = 'm';
kaitou[2] = "pHジャンプともいう。";

mondai[3] = "弱塩基を強酸で滴定するときの指示薬は、変色域が酸性側にあるものが適している。";
seitou[3] = 'm';
kaitou[3] = "";

mondai[4] = "塩酸の標定の標準試薬には、水酸化ナトリウムが用いられる。";
seitou[4] = 'b';
kaitou[4] = "炭酸ナトリウムが用いられている。";

mondai[5] = "指示薬としてフェノールフタレインとメチルオレンジを用い硫酸で滴定することで、水酸化ナトリウムと炭酸ナトリウムの同時定量が可能である。";
seitou[5] = 'm';
kaitou[5] = "ワルダー(Warder)法である。";

mondai[6] = "非水滴定は、プロトン性溶媒中で行う。";
seitou[6] = 'b';
kaitou[6] = "非プロトン性溶媒中で行う。";

mondai[7] = "塩酸、硫酸、過塩素酸のうち、酢酸(100)中で最も強い酸性を示すのは硫酸である。";
seitou[7] = 'b';
kaitou[7] = "酢酸(100)中では、酸性度は過塩素酸 > 硫酸 > 塩酸の順である。";

mondai[8] = "テトラメチルアンモニウムヒドロキシド液は塩基性の標準液である。";
seitou[8] = 'm';
kaitou[8] = "非水滴定で用いられる塩基性標準液である。";

mondai[9] = "ギ酸溶液中において0.1mol/L過塩素酸1mLに対応する<sub>L</sub>-リシン塩酸塩(182.65)は18.265mgである。";
seitou[9] = 'b';
kaitou[9] = "リシン塩酸塩1モルは過塩素酸2モルに対応する。よって、対応量は9.132mgである。";

mondai[10] = "クリスタルバイオレットは非水滴定の指示薬に用いられる。";
seitou[10] = 'm';
kaitou[10] = "";

mondai[11] = "エチレンジアミン四酢酸二水素二ナトリウム(EDTA・2Na)による金属イオンのキレート滴定は溶液のpHの影響を受けない。";
seitou[11] = 'b';
kaitou[11] = "pHの影響を受ける。";

mondai[12] = "EDTA・2Naと金属イオンの反応の条件付安定度定数が小さいほど滴定終点がわかりやすい。";
seitou[12] = 'b';
kaitou[12] = "大きほど(10<sup>8</sup>以上)終点はわかりやすい。";

mondai[13] = "キレート滴定に用いる指示薬はそれ自身がキレート試薬である。";
seitou[13] = 'm';
kaitou[13] = "";

mondai[14] = "EDTA・2Na標準液の標定に用いる標準試薬は金属ナトリウムである。";
seitou[14] = 'b';
kaitou[14] = "標準試薬は金属亜鉛である。";

mondai[15] = "エリオクロムブラックT・NaClは金属指示薬である。";
seitou[15] = 'm';
kaitou[15] = "";

mondai[16] = "ファヤンス(Fajans)法では、クロム酸を指示薬として用いる。";
seitou[16] = 'b';
kaitou[16] = "ファヤンス法はフルオレセインナトリウムなどを指示薬として用いる。クロム酸を用いる方法はモール(Mohr)法だが、クロムの毒性により最近使われなくなった。";

mondai[17] = "ハロゲンイオンに過剰の硝酸銀を加え、過剰の銀イオンをちおシアン化物イオンで滴定する方法をフォルハウト(Volhard)法という。";
seitou[17] = 'm';
kaitou[17] = "";

mondai[18] = "フォルハルト法での終点は、チオシアン化物イオンと銀イオンから生成した赤色の錯イオンにより判断する。";
seitou[18] = 'm';
kaitou[18] = "鉄錯化合物(FeSCN<sup>2+</sup>)により呈色(赤色)する点を終点としている。";

mondai[19] = "フルオレセインナトリウムは吸着指示薬である。";
seitou[19] = 'm';
kaitou[19] = "";

mondai[20] = "硝酸銀標準液の標定に用いられる標準試薬は塩化ナトリウムである。";
seitou[20] = 'm';
kaitou[20] = "";

mondai[21] = "オキシドールは、過マンガン酸カリウム標準液を用いて定量を行う。";
seitou[21] = 'm';
kaitou[21] = "";

mondai[22] = "アスコルビン酸の定量において、アスコルビン酸はヨウ素液により還元される。";
seitou[22] = 'b';
kaitou[22] = "還元反応ではなく、酸化反応である。ヨウ素は酸化剤として働く。";

mondai[23] = "ジアゾ化滴定は、酸化還元滴定の一種である。";
seitou[23] = 'm';
kaitou[23] = "";

mondai[24] = "過マンガン酸カリウムはその溶液が赤紫色であるため、過マンガン酸カリウム自身の色を利用した終点の検出が可能である。";
seitou[24] = 'm';
kaitou[24] = "MnO<sub>4-</sub>(赤紫色) → Mn<sup>2+</sup>(無色)の色調変化を利用する。";

mondai[25] = "フェノールに臭素を反応させると、フェノール1モルに対し臭素分子(Br<sub>2</sub>)2モルが反応する。";
seitou[25] = 'b';
kaitou[25] = "フェノール1モルに対し臭素分子3モルが反応する。";

mondai[26] = "中和滴定の終点の検出に電位差計を用いるときには、指示電極として白金電極を用いる。";
seitou[26] = 'b';
kaitou[26] = "白金電極ではなく、ガラス電極を用いる。";

mondai[27] = "芳香族第一アミンのジアゾ化滴定の終点検出には電位差滴定が用いられる。";
seitou[27] = 'm';
kaitou[27] = "電位差滴定や電流滴定で検出可能である。";

mondai[28] = "電気伝導度滴定は、中和滴定の終点検出に使用することはできない。";
seitou[28] = 'b';
kaitou[28] = "使用可能である。";

mondai[29] = "電位差計による沈殿滴定の終点検出には、指示電極として銀電極が用いられる。";
seitou[29] = 'm';
kaitou[29] = "沈殿滴定は過剰になった銀イオンを検出する。";
