var num_max = 10;
var mondai = [];
var seitou = [];
var kaitou = [];

mondai[1] = "液体クロマトグラフィーは、固定相と移動相に対する親和性の差を利用して分子を行う。";
seitou[1] = 'm';
kaitou[1] = "";

mondai[2] = "ガスクロクロマトグラフィーが適用できる物質は、気化できる物質に限られる。";
seitou[2] = 'b';
kaitou[2] = "移動相の種類を変えても溶出順序が変化しない。";

mondai[3] = "液体クロマトグラフィーが適用できる物質は、気化できる物質に限られる。";
seitou[3] = 'b';
kaitou[3] = "気化できる物質に限られるのはガスクロマトグラフィーである。";

mondai[4] = "薄層クロマトグラフィーに用いられるR<sub>f</sub>値の最大値は1である。";
seitou[4] = 'm';
kaitou[4] = "R<sub>f</sub>値の範囲は、0以上1以下である。";

mondai[5] = "液体クロマトグラフィーのサイズ排除モードでは分子量の小さい物質ほど早く溶出する。";
seitou[5] = 'b';
kaitou[5] = "分子サイズの大きい物質ほど早く溶出する。";

mondai[6] = "紫外可視吸光度検出器は、ガスクロマトグラフィーの検出器として汎用される。";
seitou[6] = 'b';
kaitou[6] = "ガスクロマトグラフィーではなく、液体クロマトグラフィーの検出器である。";

mondai[7] = "電子捕獲検出器には通常、<sup>3</sup>Hや<sup>63</sup>Niなどの放射線源が使われている。";
seitou[7] = 'm';
kaitou[7] = "";

mondai[8] = "質量分析計は液体クロマトグラフィーの検出器として使用することは困難である。";
seitou[8] = 'b';
kaitou[8] = "使用可能である。液体クロマトグラフ-質量分析計(LC-MS)として利用されている。";

mondai[9] = "液体クロマトグラフィーでは誘導体化が行われることがある。";
seitou[9] = 'm';
kaitou[9] = "";

mondai[10] = "ガスクロマトグラフィーで用いる熱伝導度検出器は、有機ハロゲン類の検出に適している。";
seitou[10] = 'b';
kaitou[10] = "有機ハロゲン類には電子捕獲検出器が適している。";
