var num_max = 10;
var mondai = [];
var seitou = [];
var kaitou = [];

mondai[1] = "原子吸光光度法は基底状態の原子蒸気が励起状態になるときに特有波長の光を吸収する性質を利用したものである。";
seitou[1] = 'm';
kaitou[1] = "";

mondai[2] = "原子吸光光度測定には、光源としてタングステンランプを用いる。";
seitou[2] = 'b';
kaitou[2] = "原子吸光光度測定には中空陰極ランプや放電ランプを用いる。";

mondai[3] = "原子吸光光度法において、水銀イオンは金属水銀に酸化して測定する。";
seitou[3] = 'b';
kaitou[3] = "水銀は還元気化法による冷蒸気方式で測定される。";

mondai[4] = "原子吸光光度法にはランベルト-ベール(Lambert-Beer)の法則が適用できない。";
seitou[4] = 'b';
kaitou[4] = "一定濃度範囲内では原子吸光光度法でも吸光度は濃度や層長に比例する。";

mondai[5] = "原子スペクトルは線(輝線)スペクトルである。";
seitou[5] = 'm';
kaitou[5] = "";

mondai[6] = "発光分析法は、励起状態の原子やイオンが基底状態に戻る際に特有の光を発する現象を利用している。";
seitou[6] = 'm';
kaitou[6] = "";

mondai[7] = "格好分析法において、発光強度を測定することにより定性分析が行える。";
seitou[7] = 'b';
kaitou[7] = "発光強度は元素濃度と比例関係があるため、定量分析に利用される。";

mondai[8] = "フレーム分析法は、測定できる原子がアルカリ金属やアルカリ土類金属に限られる。";
seitou[8] = 'm';
kaitou[8] = "励起部に温度の低い化学炎を用いるため、測定金属が限定される。";

mondai[9] = "誘導結合プラズマ(ICP:inductively coupled plasma)発光分光分析法に利用されるプラズマの温度は300~400K程度である。";
seitou[9] = 'b';
kaitou[9] = "非常に高温であり(6000~8000K)、ほとんどの元素を励起させることができる。";

mondai[10] = "ICP-質量分析法は、通常のICP法よりも検出感度が向上する。";
seitou[10] = 'm';
kaitou[10] = "";
